["Is it vesa compatible?", "Does this tv allow me to play contents from my ipad or iphone?", "What is the width of the stand end to end ?", "Can this be wall mounted", "Whats the wattage on it how much power does it use", "Does it have closed caption?", "Is this 110/220v?", "Does it work with fire tv", "Is there a connection for cable TV?", "Is anyone using this tv as a computer monitor? how does it do? is it as good as a monitor?", "does this tv works with prime video and netflix and roku", "What is the return policy if I don’t like it?", "How wide is the whole tv? Besels and all", "This version does have samsung mirroring?", "Does it have a Webcam and microphone", "What is oneremote? i will have an xbox connected to one of the hdmi inputs, so will oneremote be able to select the correct hdmi input?", "how many inches does it stick out off the wall?", "Since no headphone output, is there an rca audio output?", "How tall are the stands", "Does it come hmdi cable/ cord?", "Sorry if this is a dumb question, but is this a \"regular\" tv? it looks like a monitor! will i be able to plug in hdmi cables & amazon firestick? thx!", "Does it come with a remote control?", "how to turn off eco ?", "Can you stream youtube tv on this set ?", "what is the thickness of the tv without the stand/legs? I want to mount it to the wall.", "Does this tv have ambient mode?", "Does it work with chromecast?", "Can this tv utilize the audio return channel (hdmi) for connection to a sound bar or is the only option an optical connection?", "all my tvs have 100% viewing angle and i can't imagine anything else. how problematic is it with this one? ugh this would be a dealbreaker.", "Can I do screen mirror from my iPhone to this tv?", "Does this model have a headset jack? Does it upscale streaming and over the air input? Is there an over the air tv schedule?", "Does it have the sling app", "Can someone measure the height from bottom to top at the center? Wondering if logo adds to posted height by Samsung.", "whether there is wi fi on it", "Will this tv work with samsung tv sound connect? i have a samsung radiant360 r5.", "I am interested in 4k but pretty much everything i watch is hd (1080p) so can you advise if i would be sacrificing quality going to this tv?", "does it have ambient mode?", "I have a magnavox dvd player/recorder. it has rca jacks for audio/video, can i record and playback using a hdmi/rca converter on this tv?", "can you search the internet via your computer on this tv?", "What is the height of the TV with legs installed", "Can you watch tv on this using the Directv app?", "Does this have PIP , picture in picture ?", "Can this tv be used in an RV?", "is the spectrum app on it so that i can watch spectrum without a cable box?", "How tall with stands", "Does this tv have the now tv app?", "Do you have to use one of the hdmi ports for a chromecast stick, or is the casting (from phone to tv, for example) capability built in to the tv?", "Does it have a usb-c port?", "How many usb ports does the 32\" tv have?", "Is this HD", "Does the height of 18.8 inches include the stand? I have about an 18 inch space to work with.", "can I connect my dvd player?", "Is there a 3.5 mm audio output (headphone type)?", "Is It Alexa compatible?", "Does this tv have USB ports?", "How can you connect a non-Bluetooth headset to this TV since it has no headset jack?", "Can you use this without alexa? also do you have to talk to the tv as one reviewer said? i think i wouldn't want that.", "Does this TV have an on timer?", "How many inches is it from one leg of the stand to the other?", "Hi what is the voltage ?", "Does it have Bluetooth", "Does this tv have a composite \"Audio Out\" port? I need to connect a wireless earphone transmmiter.", "Would you tell me whether the tv is connectable with verizon fios cable ?", "Will the remote control vary the volume on paired bluetooth devices or does the TV ouput a fixed volume?", "does it use a one connect box?", "Will it make every category on the x box one x 4k menu green? i'm annoyed that my 43 inch tcl doesn't meet all the requirements especially for gaming.", "Is there a significant amount of motion blur while gaming?", "Does this tv have an antenna output and does it have the vesa hole pattern for wall mounting?", "What wall mount fits samsung qn32q50rafxza flat 32\" qled 4k 32q50 series", "My 3 year old 32\" samsung tv doesn't have the utube tv app and i had to use a firestick which i hate. does this qled tv have the utube tv app.?", "Is there a way to connect using Ethernet cable?", "installation available?", "Does it have screen mirroring with galaxy s8?", "Does this TV have the smart hub feature to add more apps?", "By connecting a 4th gen apple tv that is internet connected, can one bypas any samsung software or interface such as their tv plus feature?", "How do you turn off the remote hints on the TV, for example the hints that tell you how to control the volume/channel/ect?", "Does it have variable audio capabilities", "Will this tv wireless for streaming via hotspot ?", "Can this TV be used with Xfinity", "Does this have and on off timer?", "Is this good for Call of Duty Warzone?", "what are the dimensions with the stand?", "what is the motion rate?", "does it have variable headphone jack volume out?", "Can I go online and access my email and other websites?", "What size screw does it need for the vesa mount?", "Does it support hdmi 2.1 ?", "can i completely forgo an apple tv & download any/every app i want? in other words, is every app permitted & i can just use onscreen menu to watch tv-", "Can this tv be mount on a desk?", "Is this tv hdr 10?", "Does it connect with wi fi?", "do i need a soundbar with this tv?", "Can you get disney+?", "Can this tv be hang", "Do I need a special cable with this tv?", "Can this connect to both a bluetooth speaker and keyboard ?\r\nI mean does this have support for multiple connected bluetooth devices ?", "What is the hdmi standard this tv is using 2.0 or 2.1?", "Can built in airplay connect to an Apple homepod", "Has anyone successfully mounted this tv? if so, what specific screws did you use? my manual calls for an m4 with a 1.25mm pitch, which i can't find.", "Can the voice function be turned off?", "Does it get 220v and it have Europe electricity power cord ?", "Where is this TV manufactured?", "Does this 32\" 4k q50 tv support airplay 2?", "Does this model have airplay 2? it's not specified in the details, but it shows that this model has airplay 2 on the samsung website.", "What operating system does it come with?", "Do you use bolts or screws to mount it to a vesa mount?", "does it have or can you add the appletv app? thanks", "what is the distance between the legs?", "Can you get cbs access on this tv?", "How many hdmi ports does this tv have?", "I use an outdoor antenna. Use wifi for netflix and amazon prime. Do I need to disconnect my out door antenna to access wifi or can i switch off?", "Any wallmount recommendation links from any of you nice people? Flat on wall with maybe slight tilt-a-bility", "Does this work with wireless bluetooth head phones?", "what panel type is it? ips, va or tn?", "Where is it made? (Which country?)", "Will this TV work with Directv receiver?", "CAn you use this tv without turning on the smart features", "Does this TV have the ability to split the screen to play from multiple sources?", "Is this a 2020 model?", "Can you get shorter leg stand ?", "Does it work with 220v?", "Please someone tell me how i get this tv to shut up??? i hate this voice that announces every little change. not much time to play around with it.thnx", "When connected to a PC, what's the maximum resolution this monitor can accommodate?", "Are the vesa holes in the center of the tv?", "Can you mount this television to a regular wall bracket?", "Is this compatible with an outdoor antenna? I see it does analog; but even tower signals are now digital.", "Is the TV Freesync compatible?", "Can you just use the cable remote, or do you have to use both the t.v. *and* the cable remote?", "What size screw for the back of the tv if you wanted to wall mount it? The M4, 20mm .70 pitch does not fit the back of the tv. It slides right through", "Does this 32” set display HDR?", "Are the hdmi ports 2.0? I’m assuming so because it’s 4K but just want to confirm.", "Does this TV support 2K (1440p) resolution?", "Does this tv have the ca proposition 65 warming?", "Why does amazon claim \"works with alexa\" when the only command that works is power off? volume control doesn't work nor does channel up/down.", "Is this a monitor or TV?", "Can this tv be mounted on a vesa mount?", "TOS audio connection?", "Width of the stand from end to end ?", "What size screws to hang the tv - someone said the pitch is 1.0 but what size screw as the size in the booklet is wrong as well?", "Does this model have component and hdmi ports?", "Where is the USB port, on the side or in the back?", "Does it have hdmi arc port?", "Does this have apple tv app built in?", "It's says 55 but then it shows 49.5 on the diagram. Whats the actual size ?", "Is Alexa built in this tv ?", "how is this for the PC and ps4 pro?", "where is the microphone located, and can it be shut off?", "Will this tv connect to a mobile hotspot? Need verification, not just a guess.", "Does this tv have the new apple tv built in??", "what Is difference between Q60T 2020 model and Q60 2019 model?", "120 Fps at 4k ?", "Can i hook up dvd player?", "Does it have Sling and Disney plus apps?", "Do it come with google assistance", "Is this model direct tv ready?", "Do you need to purchase a hdmi cable to make the picture quality better?", "I have comcast... does the voice feature (Alexia) work with comcast. Keep in mind that comcast has its own voice sydtem.", "Dolby vision. Does the 43 in have Dolby vision?", "Does the hdmi cable come with qled tv", "Is the q60 that much different from q70 in terms of image quality and color?", "Can i install an kodi app on this samsung tv?", "Does it get it get hbo max?", "can i use this with my pc", "How long manUfacturing warranty", "Does this TV support Airplay 2?", "How do I connect this to a mount? The mount holes don't look like they fit screws.", "Can I do payments?", "What does Amazon Certified mean?", "Is this samsung 55 a 8 series t.v", "Does it have pbs passport?", "Will i be able to control the tv with apple home app?", "do you need a sound board to hear this tv???", "does the mount kit come with the sound system when you buy the tv and sound system together", "When using hdmi cec to to control my soundbar, is it possible to show actual numbers for the volume?", "Will the 85 inch fit on a stand 60 inches wide?", "Can I access radio frequency headphones with this TV?", "does this tv have speakers built in?", "Can you opt to have word print on the screen", "What are the differences between this and the TU8000 aside from the supposed better screen", "Where is it made?", "Can you get emby on this tv?", "Does this have Apple TV app ?", "Can it do 1440p at 144hz. Does it have game mode to help with gaming", "Does it have hdmi 2.1?", "Is firestick compatibility problem with samsung tv stil there?", "What remote comes with this tv ? Is the remote voice control ?", "does the samsung 50\" crystal UHD have a headphone jack", "Dose it have buid in wifi", "Motion rate?", "Dose this TV have bluetooth?", "Does it have Alexa?", "Does it have an amazon app? Or will I need my fire stick?", "How to get local news channel?", "Does it have a RJ-45 slot?", "does this tv have bluetooth", "Can you search the internet?", "Does this have hdmi 2.1?", "How many hdmi and usb ports", "What kind of apps are built in and can you add apps to this tv?", "How many hdmi ports are there?", "Does Samsung have a cable card slot", "What remote does this come with ?", "volume sound leveling?", "what is the outside distance beween the legs? My stand is 38 inchs wide.", "Does this tv have table mounts?", "What is hangers I can use to support this tv , if I want to hang it up to the walls", "Does it accommodate headphones that are Bluetooth", "Can you cast a Samsung cellphone device to this tv? Like whatever you're watching on your phone be casted on to the tv?", "Does this tv have a camera? Will it support zoom?", "how far the feet placed apart?", "Does this have app for hulu ?", "does amazon install tvs and set up--cost?", "What is refresh rate", "i wonder the alexa control is far field voice control or from the remote?", "Can you mount different feet on this tv for smaller table? have mount screws on center of back of tv?", "are there multiple on/off timer options as in previous models?", "Does this have Dolby vision", "Does this tv have local dimming?", "How much internal storage does the TV come with?", "Does this tv have netflix, disney?", "Can i put some down and make some payments every month", "What volt is this t.v?", "Does this have hdmi 2.1", "Which wall mount for qn65q60tafxza?", "Does the tv have a night mode or some type of blue blocker setting?", "What series is this TV?", "Can you control this tv with the apple tv remote thru hdmi-cec", "Does it have bluetooth?", "What type of power cord does it use?", "Can this TV be used in an outdoor covered patio setting? How outdoor safe is it?", "Had a 10 year old 55” Samsung mounted to wall that this tv will be replacing. Can I use the same bracket for this tv?", "Does it support vudu?", "can this tv be mounted to the wall?", "Hdmi 2.1? people are saying yes, people are saying no. which one is it?", "Which articulating wall mount can I use?", "Is there any other audio output besides the digital audio?", "How good is this tv for gaming?", "Does it come with a stand? Don't want it on the wall.", "Does it work with a Directv remote and control the volume?", "Does this tv support imdb tv via prime video?", "Does this tv have ambient mode?", "Sigh... what's the vesa pattern for this tv? come on, amazon, please list this info in the features highlights at the top of the page!", "Does this TV come with a mall mount?", "Does this tv have a composite audio out to connect a wireless earphones transmitter?", "the dual LED, is that edge lit ,full array, or other technoleoy? How does it work?", "Built on speakers ?", "How to do sign in with amazon frozen ,cannot move up and down", "How well does this TV handle screen frying?", "Can I get YouTube free?", "Is there antenna connection? Also I don’t have any other smart devices. Will it work without any?", "How many mounting holes are on back of tv ?", "Does this include built in Alexa...?", "Can you connect 2 bluetooth devices?", "does this TV work better with an internet connection?", "Does it have hdmi arc?", "Funciona en 220v?", "Is the power requirement 110-240V?", "How much does this TV weigh I mounting it with my old wall mount.", "can i get a center stand for the 43 inch q60t tv?", "will alexa control Spectrum cable box?", "Would anyone be able to tell me the exact measurements without the stand please?", "Is this 65\" Wi-Fi Enabled?", "Does this TV support Firestick 4k?", "Does this tv have Netflex built in?", "Is this tv 120hz?", "Does the 43inch have game mode?", "Does it support 220v ?", "I have a led lamp that is near my tv and is sometimes has a glare when there is something a bit dark on the tv. does this tv have a lot of glare?", "Looking for Samsung 40 inch TV 2020 model", "Those this tv come with screen mirroring?", "What is the refresh rate?", "can you down load and on's ?", "For the 55 inch tv, what size is the box?", "What is the difference between a oled tv and a qled tv", "How do you wall mount this tv? There is no screw holes for bolts on the rear to hang it", "Does this have Prime Video built-in", "What color trim around is the tv? black or gray?", "Can i connect old altec 2.1 speaker system with male 3.5mm rca stereo output to tv's usb with an adapter? if so, what kind of adapter do i need?", "Able to mount to wall", "What hardware is needed to mount this?", "Does this come with a One-connect box? If not, which One-connect box is recommended?", "I like to watch sports, is the refreash rate of 60 hertz fast enough?", "Are the feet on the 43\" Metal or plastic?", "What is the distance between 2 legs? Is there 2 options for the legs distance?", "which wall mount is compatible with the samsung model# qn65q60tafxza. thanks", "Is q60t qled compatible with q70t sound bar in terms of dolby atmos and q symphony?", "Does it have global tv app if i want to download or just regular cable channels ?I live in vancouver bc Canada", "Can you disable the Alexa feature?", "Does this tv have full array?", "what is the refresh rate?", "I need to remturn 4 hub caps still in org. box & drop off at ups store. need shipping lable", "What is the warrant on the TV?", "What are the imputs/outputs", "What vesa specification fits this tv for wall mounting?", "How many hdmi ports does it have?", "is this tv netflix ready?", "Can the second hdmi allow the tv to also be used as a computer monitor? i want to use it on a desk as a tv and occasionally as a second monitor.", "How tall is the unit without the feet?", "If I lose power or turn off the TV while on a specific website on the browser, does it power back on with the browser and same webpage loaded?", "I have a Samsung S9 smart phone. Can you connect to the internet using the phones teathering feature?", "Can i load sling tv onto this model?", "Does this tv have an on/off timer? I like to wake up to the tv.", "Can I download sling and hotstar as app in the tv without adding any additional devices to the tv?", "Does it have PIP?", "can i use a exteranl hard drive to play movies from ?", "Can someone please give me the dimensions of the tv from the perspective of the stand? i trying to fit it into an existing tv cabinet. thanks!!", "does it come with remote?", "Does this have an eye-saver mode if it were to be used as a computer monitor?", "Is this TV compatible with external hard drives?", "can this be hooked up to wireless headphones?", "Is this a brand new tv", "Does USB port play movies?", "what is the measurement between the two stands?", "Tienen conexion wifi?", "Does this TV have an Amazon streaming app?", "Is this tv wall mountable?", "Does the samsung un32n5300afxza 32\" smart led tv support the mlb app for watching major league baseball?", "does this smart tv have the prime video app?", "is the screen real delicate I have small children that like to touch the screen when a show asks where the objects are at( watching dora the explorer?", "What does the remote look like - is there an aspect ratio button (for OTA viewing)?", "Can i pay by using visa gift cards", "Can i connect my s7 to this tv?", "what is the depth (how thick) without the stand", "does this tv have a browser?", "Can i watch itunes purchases on this tv?", "does this tv have a camara hidden in it?", "Can the screen be turned off and have the audio playing?", "Does this model support hdmi arc?", "what 802.11 version is it?", "How wide apart is the stand from side to side?", "Can you cast or mirror from a mobile device?", "What are the dimensions of the screen by its self?", "Can I stream pluto TV?", "What size versa mount?", "Can anyone please tell me how close the tv feet (stand) are to the edge of the tv - left and right? thanks in advance. i have a space issue.", "Can you get google play music?", "Has anyone been successful in hooking up a wireless tv (sony headphones rf98rk) to this tv?", "Have lan port ?", "Do the necessary cables come with the set, or are they purchased separatley?", "Very black sides. How do I make it lighter?", "Can I use TV as a monitor for my laptop", "Does it have a headphone jack?", "What table top swivel tv stand will work with this unit? the component panel is in the center which ordinary stands cover so no access to plug ins", "Is this bluetooth?", "Can the tv be connected to a router without enabling wps?", "Can I cast this tv with an iPhone?", "Does it have amazon app?", "Is the smart tv wireless? I am new to purchasing one", "How many inches\\feet is between legs?", "Can i add the hbo max app?", "What type of wall mount can I use with this tv?", "Is this tv 4k?", "Does this tv have a usb slot? If so can it play videos off of the usb drive?", "can this be mounted on the wall", "How much I will pay for this tv ?tv price and delivery charges?", "What is the voltage?", "Can this tv live stream hulu", "Is this TV is 60 hz or 120 hz", "Can i connect it to an apple macmini?", "One reviewer said the sound quality was good and another said it's a problem. What's the consensus?", "will this tv work in nigeria???", "Is there bluetooth?", "Does it support youtube tv?", "Does it have hbo go or hbo max?", "Can this tv be used as a computer monitor?", "why does tv say 32 inches but measures 29 inches from left to right", "I have not received this order?", "Can this tv work with 220 V or I need a transfer?", "What is a satellite input? Does TV need an antenna?", "is this tv Roku enabled?", "Can you download version fios app?", "I have cable. Can I connect this tv to a coxacial cable from my cable box?", "Does it have a browser and app store?", "Is this tv have hdr?", "Can this tv work on a X-Box One system to play?", "What to do if it is damaged during transportation", "can this tv be wall mounted", "Is this tv compatible with fubo tv?", "Dimensions with stand?", "How do you access the browser?", "what is the response time on this TV?", "Can i hit spot to tv? can i mirror iphone to tv?", "what does the remote look like? I have a 49 in samsung that has the remote one and I hate it. Please send picture", "What is the height and width of this tv with the stand??", "Any wires needed or is everything included?", "Can I connect to a browser? I want to stream my workouts on the tv", "Does this tv stream youtube tv ?", "How long is the 115v power cord on the back of the tv?", "How do you adjust the brightness?", "The box my TV was delivered in was extremely beat up with security tape around the top and down one side. Is this normal?", "can i control the tv using my windows PC or laptop (win7 - win10)?", "What wall mount do i need for this TV and if a return is necessary (i would only return if it did not work properly) are there charges or free return?", "What is the name of the browser?", "Bluetooth enabled?", "Can i connect my cable box to this tv with an hdmi cable? i did so and my un32n5300 says that it does not have hdcp capability and con not connect.", "Does it have an audio output port?", "Does it have bluetooth connectivity available?", "Is this set actually 32\"? It claims 28.9\"", "can I connect external HD to play movies?", "Is one of the hdmi ports labled arc?", "Does this have samsung tv plus?", "Is the USB input for music, mp4 videos, photos?", "dimension height?", "Does this Smart TV operate with a wireless wifi hookup?", "where do I buy replacement remote?", "Does the tv have a single foot platform in the middle instead of the two feet at the sides of the screen?", "Can i mirror my galaxy note 9 to this tv", "Is there any other audio out besides the digital out?", "Does this TV have bluetooth to use with wireless headphones?", "Would wifi headphones work with this tv?", "What is the amazon's return policy for samsung 32 inch tv?", "Will this tv block bootleg media? Like my dvd player does?", "Looking for a good wireless headphone that is compatible with this television since there is no headphone jack. Could someone please advise? Thank you", "Will this TV work in kenya without much complications? And is thete a guarantee to deliver it unbroken", "Does this TV have an auto program option?", "can I use external speakers to enhance the sound ?", "Is this Alexa compatible?", "Can you use a ps4 with this tv?", "Does it work with Alexa?", "Does this tv support 5ghz wifi?", "Does this have the youtube tv (not just youtube) app?", "Does this TV come with apps?", "Can it be fed directly with a cat5 instead of WiFi?", "Can you tell me what the best tv picture settings are or where to find the default settings?", "Will it look good if I connect my Xbox one s to it", "Can I connect a wireless keyboard and mouse?", "can you get the xfinity x1 app on this?", "Can this TV get the Disney+ app?", "Does this tv support apple tv app?", "Why would someone need a firestick? I thought it was pre loaded?", "Is this samsung tv compatible with apple products i.e air play/mirroring", "Can I download other streaming apps to this set?", "can you browse the internet with this tv ?", "Does this tv come with a remote? is this tv wifi? does this tv with software like netflix and hulu?", "what are dimensions with stand?", "Will this TV stay upright with the stand (legs) unattached? I think this will be perfect for my needs if it will stay up on its own without the stand.", "Is this tv compatible with any wall mounts?", "Using this monitor for remote tv broadcasting. can we access an external 2tb hard drive via a usb port? anyone??", "Can i watch cbs all access on this televison?", "Is this an oled screen?", "Can i mirror my samsung phone to this tv?", "Where can i order the feet (stand) of this tv? I bought it for my sister but she unboxed it after 3 months only to find out the feet are missing.", "can this tv be hooked up to my direct tv cable box?", "what is the distance in inches between the stand and the end of the unit?", "Will the armstrong 17\"-42\" swival/tilt tv wall mount work for this tv? It says on the back fits most tvs vesa patterns up to 200/200.", "How many watts does it use", "Is this TV wall mountable? Is the 18.2” dimension, with or without the stand?", "Will a soundbar fit under the screen?", "Does this model require a sound bar? Is it compatible with Roku.", "Does this tv have chrome cast and also bluetooth ?", "What is the refresh rate?", "Can i get sling without a fire stick?", "Is there a power cube with this model, or just a straight power cord to plug in the wall?", "Can i hook up my old sony dvd player?", "what chanells can i get with the antenna?", "Does this TV support picture in picture?", "Can i connect this tv to my blue tooth speakers? i see some negative comments about the sound quality, so this would be very important.", "Note to samsung: i was read to buy this until i found that there are no controls on the set. do newer models have control buttons on the set?", "are there on/off, volume control and channel up/down on tv itself? do you have to only use remote?", "does it have sleep timer?", "Can the two stands be reverse-installed? swap the right to left & left to right? my tv stand isn’t wide enough for the feet to be installed as shown.", "Do I have to purchase a digital antenna separately to pick up channels?", "Setting suggestions to improve the picture quality at night? Have ecosensor off, but without sunlight picture is harsh and not clear. Good during day.", "Does this tv have smart view, screen mirroring", "can i use a wireless head set?", "Can you pair this with a wireless speaker?", "Is it WiFi?", "it appears that the n5300 stand (2 small legs at each end) is not weighty and that the tv could easily tip over if you brush against it. is that so?", "do i need a antenna?", "Can it play the hulu live app?", "Does the usb port support media movies from a flash drive or an external hard drive.... or is it a usb power port!?", "Does this tv have an ethernet jack", "Has any one had a problem with remote? it does not always work. i can’t turn on the tv ( batteries are new and nothing is blocking the tv).", "Are both hdmi connections on the side, and how much additional width must be allowed to accommodate connector and cable clearance?", "How do I use a digital antenna with this tv?", "will it mirror my computer?", "What is the distance from the top mounting screw to the top of the TV?", "Can it work with steam", "Is one of the apps HD Homerun?", "How is the refresh rate ?", "Looking to purchase a samsung 32\" un32n5300. have the issues of 2018 and 2019 been corrected?", "does this have the same apps as the samsung 60 \"smart tv ?", "Is the frame glossy or flat black?", "Can the Spectrum cable app be used on this TV?", "Most tv cabinets that hold a 32 \" tv have a bit more room. But not enough for a 40\". Will anyone ever make a 35 or 36 inch tv?", "does it have Roku built in or is it capable of downloading apps like Xfinity's X1 app?", "I dont see that it has a built in tuner. Will it work with my over the air antenna?", "Does this TV have a web browser?", "Does this have a full web browser?", "Is there a built in browser so the internet can be accessed as web pages?", "Does this model sort Disney Plus?", "Does it support portrait mode?", "How fast does it load apps from start up? my current tv takes a few minutes to \"initialize\" before it will let you load netflix.", "Can you download additional streaming apps - to watch via wifi streaming mlb.tv, nhl.tv, nba league pass?", "is the tv new in box", "Can anyone tell me how close the feet (tv stand) are to the edge - right and left? I have a space issue. Thank You!", "can this tv stream espn", "Do this tv have vudu?", "Can i screencast or mirror phone if so does it need internet?", "Does it have Bluetooth?", "What’s the power consumption on this tv?", "The tv is categorized as an oled tv but i see the frame used the led backlight. is this a oled tv or just a led tv?", "Does the tv have an alarm? I like to wake up to the television.", "If i have a nas server on my house network, is there an app on the tv that will me watch shows i have stored/recorded there?", "it's also able to connect to direct tv right?", "No RCA stereo outputs?", "Can I connect the ethernet/internet cable directly to this TV?", "Does anybody know how to turn the screen mirroring function on?", "Does the tv have Chromecast built in? I need to stream from my phone and laptop.", "Do this tv have the youtube tv app not youtube app but youtube tv app?", "Does this tv have the apple tv app?", "Que año de fabricación es este equipo?", "does this tv support playing mp4 video from the usb drive?", "Does it have sound?", "Does this tv have universal mounting points in the back so that it can be mounted on a stronger single post stand?", "I have a bose sound bar that's 2 5/8\" high. if i put that in front of the tv on the stand, will it block the access point for the remote?", "Can you set up the TV without installing smart things?", "can I record to a usb stick or hard drive with this?", "Will i be able to get the wwe network with this tv?", "I bought the wrong wall mount screws to hold the tv on the wall mount! I need pictures and the name of the 4screws , spacers, and washers! Please", "I would like to purchase in bulk, anyone I can email or contact?", "Will this tv be okay to use outside on a covered porch?", "Can you get Beachbody in demand with this tv?", "What is the outside width of the TV?", "Does it plug directly into an outlet or does it have a transformer in the line?", "Can this TV connect to a broadcast antenna? If so what antenna type/specs are required?", "Does it have Vudu?", "Does it come with a warranty?", "Will any samsung smart tv remote work with this? mine didn’t come with the smart remote.", "Does this TV have Bluetooth capability for remote speakers?", "Does this tv come with a hdmi cable?", "Does the screen have a matte finish to reduce glare? Or not?", "Why can't you go in and steal the sound output from the speakers to drive external powered speakers?", "Does this have the netflex button on the remote?", "Does this tv have 60 frames per second", "I have dish tv service. will the dish remote work with this model?", "Please someone should help me here... will this tv works in Nigeria??? Almost all the tv I’ve seen on here they say they don’t", "can i download the directv app and watch my directv service thru the app?", "How do you add external speakers if no speaker jack or not bluetooth capable? If I use component connection then I can't seem to mute by remote.", "Can I hook up my desk top pc to this", "Can I use headphones with this tv?", "Does this TV support chroma 4 4 4?", "Can i mirror my android phone with this TV?", "Where is it made?", "Is there an audio output for headphones? Mini jack? Or do I need a converter?", "Is this blue tooth compatible? I want to use my apple ear buds.", "Would this TV fit in a in a 30 inch wide stand?", "does it have a port for wired earphones?", "What is the front to back depth of the tv stand feet?", "Does anyone know if the Xfinity app is available on this model?", "Can I listen with cordless headphones?", "Is this tv subject to uk customs charges ?", "can i download directv app on this tv?", "What is the distant between the 2 feet stands? Thanks", "czn you add a ap for spectrum", "Does the optical audio out volume vary with the volume up and down control, or is it a fixed volume output?", "Tv height without stand", "Does this tv have a built in dvd slot", "TV for in-set wall mount - how deep is the actual TV without the stand?", "does this tv come with a remote or do you have to log into the TV to find the remote funtions?", "Do i have to mount it on the wall? I hope not.", "Does it support Apple 4 K", "Does this tv support Disney +?", "Does this tv work with att tv?", "how thick is it - without the stand?", "What kind of sound bar or speakers is suggested with what type audio input? Reviews indicate sound is disappointing quality.", "Can i connect an alexa component to this tv?", "Is it compatible with Roku Express?", "How many speakers does this tv have?", "is there a wi-fi connection?", "Does this TV have a headphone jack?", "How is the sound directly from the tv?", "Does it allow audio return on hdmi ??", "Can i cast video (hulu) from my android phone to this tv?", "I need the feet for this tv. Any idea where i can find the feet?", "Does this tv have RCA connectors for audio out to a sound system?", "Can you download the xfinity stream app on this tv?", "Does this tv have a audio input Port?", "does this work with WiFi?", "Does it have dvr ability ?", "Will the stand fit on a table that is 24 inches wide? (without hanging over the edge)", "What is miro micro dimming pro", "is this tv compatible with the amazon fire cube?", "Do you have to use a Roku stick or is it built in?", "can you use a sound bar with this tv?", "wifi 802.11ac or 802.11b/g/n ?", "Dies is have a qam tuner or a atsc tuner?", "Is there an hdmi input on the side? i want to mount it using a wall mount, but only having hdmi inputs on the back makes that difficult.", "Does this tv have the xfinity stream tv app?", "will I get a new or refurbished set?", "so can I limit the max volume on this (and if not does anyone know of one I can) Downs sister blasts her tv)", "can alexa control it?", "Does the usb support looped movies playback? i need this to run a short video all day. thanks.", "tiene conexion wifi?", "What are the dimensions without a stand?", "do i have to connect to internet with this model? (un32n5300afxza, samsung 32\" tv)", "Are the stands removable?", "Looking for tv for my 94 year old Mom. Volume most important! How is the sound??", "Does this samsung tv support hulu live tv?", "Will it work in Nigeria?", "Does this TV have the Xfinity app?", "What does, “product may differ from item shown.” Mean??", "will this tv work using cable and not wifi?", "Is the plastic around the screen shiny or matte?", "We had an older version of this TV that broke during a move. I was able to mount it by threading bolts into the back...is this model the same?", "How wide are the legs(stand)?", "Does this tv have universal mounting screw points in the back to mount onto a better quality, single post, universal tv mounting stand?", "How do you get netflix or amazon prime using the remote? i cannot seem to bring them up or have them open.", "Could someone suggest a wall mount?", "What is the height of the TV without the stand?", "Does this TV come with a pedistal base for small counter top area?", "Is the remote ir (where you have to point it to work) or rf (like roku where you don't)?", "Does this tv have tv plus feature with internet connection? tv plus is ee tv network over the internet on most late model samsu smart tvs.", "How much for shipping cost srilanka?", "TV height with stand?", "Is this a new tv?", "Can video be played from usb? For example a flash drive?", "Is there a Photo of the coax and other connections?", "has anyone used the xfinity stream app with this TV model?", "What is the width at widest point of stand legs? Need it to fit on a 28.5” wide cabinet. Thanks!", "does it have bluetooth", "Does it play from external hd .avi", "Does this tv mirror to my samsung family hub refrigerator?", "Can I watch videos from an external hard drive on this tv", "Can I watch iTunes purchases", "does it have VGA?", "I dont have cable, internet or antenna. Will this connect to the wireless wifi that my computer connects too?", "Por q en la descripción dice q wi fi incorporado", "Does this model have the newest version of Hulu? The version where you can watch Hulu Live", "Do you need to purchase anything separately besides the hdmi cable?", "how much power?", "Will I need to purchase an antenna for this TV?", "Have Ethernet Port?", "What is the Best value for 32 inch smart T V ?", "What is miro dimming", "I need free shipping in qatar", "How is tv for gaming? Any lag?", "Did anyone have an electrical smell?", "Has anyone been able to watch nba league pass via the web browser and wifi on this set?", "Can you use wireless headphones through Bluetooth with this tv?", "What’s the frames per second", "Would like a clear answer, will this tv run hulu live tv without any add-ons? not hulu, no fire stk, no roku. want hulu live tv embedded", "Mirror iphone", "Does this have a place for simcards", "Will this tv play mp4 videos through the usb port using a external hard drive?", "where is the usb port located?", "Audio output?", "Does it have a coax input?", "dimension from leg to leg?", "Can this tv connect wirelessly to an existing network?", "can i airplay my laptop to the tv?", "does this model have a video out jack?", "Can you add new apps like fios tv and youtube tv (not the same as youtube)?", "Does this tv come with the necessary cables to hoook it to Direct TV?", "does it have close captions?", "Don't laugh. ok go ahead... do you still need an amazon fire stick to watch prime video on this tv? thank you", "TV will not turn back on! Has Samsung looked into this power issue?", "What are the overall dimensions of thlis tv?", "How far apart are the Tv stands ?", "Does this have smart view for my phone to connect?", "Does it work on 12v dc?", "Where is Manufacturing place?", "can the feet be moved to be a center stand", "Does it have smartview/screen mirroring?", "Can I connect to my xfinity tv through the wifi on this tv?", "For manufacturer and/or Amazon, what is the warranty on this produce?", "I'm going to flat mount this to a wall. How deep is the tv?", "Is directv now app preloaded on tv?", "Can you miracast with this tv (32 inch samsung smart 1080)? i’m looking to miracast a peloton with this monitor if possible...thank you.", "can this TV be conncted to a computer as a monitor ?", "Can you update this smart tv? Have a Vizio and utube and Hulu will not work anymore", "Does this tv support the Disney Plus app?", "is this Tv have screen mirroring compatibility?", "Do ypi half to pluge ot into the wall or is it wireless", "What sound bar is compatible?", "Does the TV have bluetooth so I can listen on my bluetooth headphones?", "is samsung tv made in usa?", "Can you add apps?", "Does this support HBOmax?", "Can you get fubo on this tv and live local channels?", "What is the difference between this model (un32n5300afxza) and un32m5300afxza?", "Can i attach my blu-ray player to one of the hdmi ports?", "does this have a sleep timer?", "Will this TV work for xbox one x gaming?", "is emby or plex available for download?", "Do i need a cable box to receive a digital signal from the cable company, or can i just connect the cable to the tv?", "Does the remote allow slow motion control?", "Does it have the Spectrum App?", "What are the outside dimensions of the TV?", "I need a LAN network connection, have it ?", "Can I connect a pc to it as a monitor thru the hdmi ports?", "Does this tv have Blue tooth", "What does 4K mean?", "What is the width of the TV without the stand please", "does this support Air Play ?", "Does this tv support Hulu live or just the old hulu app?", "If I have a photo on a usb drive can I use it/see it on this tv? I’m an artist doing oil paintings and hoping to use tv to view reference photo.", "Need tv with rca audio outlets which connects to tv ears for 94yr mother. current tv has headphone jack which need to be plugged which she can't hers", "What is the distance between the wall mount holes on the back of the TV?", "Is the Divan.tv app included?", "I am unable connect with terms and policy set-up...my internet is not the issue/", "Can I watch 4K movies?", "if this TV doesn't have bluetooth built in for headphones, can it be used in smartphone app for listening by bluetooth?", "Does it have Screen mirroring", "Can i download apps from the android play store onto this tv?", "What is the distance of the feet - widest edge to widest edge. i have 28 inches of space for the feet to sit flat. thank you ~roz fruchtman", "Which operating system is it running?", "Does this TV have bluetooth?", "Can you download apps? i thought the samsung smart tvs were an android os. i want to be able to dowload the spectrum tv app", "Is terrestrial RF input the same as antenna?", "Can this TV be set up to a console", "Does this model have audio input Port?", "Can this TV be wall mounted?", "Can this TV work as a computer monitor ?", "Watch is the actual size from end to end", "Does this have a built in digital tuner?", "Can we use our phone hotspot to do games apps internet etc?", "What is the exact depth without the stand? i am desiring to mount in an rv where my existing tv is mounted in an outside compartment.", "Does this tv connect to a 5g WiFi?", "Is this tv a 4k?", "With the feet can the tv fit on a table that is 9 inches deep?", "Does this TV work with Alexa?", "Will this television work for streaming xfinity using the beta app?", "Does this support Airplay video? How is the performance?", "is this tv just for wall mounting?", "I see what looks like 4 holes in the middle for the mount. But the photo is so dark maybe they are screws. I am trying to use an existing mount.", "Please explain about the wi fi?", "Will i use my cable box remote ? comcast.", "When watching a widescreen movie on this TV, does the picture cover the whole screen or are there black lines on the top and bottom of the picture?", "Can the Samsung 5300 record?", "Does this 5300 have Bluetooth?", "How long does it take to load apps from start up? My current tv needs a few minutes to \"initialize\" before it will let you load Netflix.", "Does it. Come with blue. Tooth?", "Extended warrenty i know that I purchased the warrenty where would I find the receipt?", "Can this connect to Sonos speakers wirelessly?", "Does this tv have spectrum app?", "Does it work on 220 voltage (like in Europe)?", "Can i use this tv alone to access netflix and hulu from my wifi hub? that is, do i need another cable or dsl box? thanks all! joe", "In regards to apps, does this have hbo now or hbo go?", "spectrum cable is going 100% digital in my area. do i need to rent their digital box, $7 @ month, or is the digital format built-in this tv?", "Does it work on 220v ? it should say somewhere on the back. usually it says 110-220 v .", "How many inches are the base legs apart?", "Is the remote universal?", "Does this tv come in white or off white for girl bedroom?", "How much storage does it have to install apps? The 2017 has no room to install other apps because the pre-installed apps take up all the space..", "Can anyone confirm this model has the Xfinity app?", "It was in the recent news about a hacked nest security camera. does this wifi tv have a built in camera & that needs to be covered for security?", "Wall screw size", "What are the audio output ports? mini jack? or what? i have seinheser headsets so i would like to know about audio output requirements.", "Does it connect directly to psvue app", "Does this tv supports directvnow?", "I had to have the circuit boards replaced after a year and very little use. I am now having trouble with the remote.batteries are new. Help??", "can I use a wireless bluetooth speaker with this tv", "Dimensions without stand?", "Can you view .pdf files via a usb flash drive? is there a remote control?", "How large would an inverter have to be to run this unit", "Any problem hooking this up with Apple TV?", "Is there a warranty?", "How’s the sound?", "Does this tv have screen mirroring?", "Can you mirror or screencast your tablet to the TV and vice versa?", "What apps are on this tv", "Can you cast youtube videos using an an Iphone (is it iphone compatible?)", "Does the 1080p smart led tv come with the direct tv now app?", "Does this one support bluetooth headphones?", "Does this tv stream \" hulu live tv\" not just regular hulu...", "Does the tv feature auto motion plus? (Auto motion plus makes images move smoother by inserting extra frames in between)", "Can you mirror ipad and iphone on this tv also known as airplay mirroring? does it have to be on the same wifi network?", "Will bluetooth headphones work with this ty?", "What are the dimensions with a stand", "Does a standard mount work for this tv?", "Do I have to add anything to this system to stream from Amazon Prime?", "Can we turn Alexa off?!?", "will it work with air play?", "Im concerned about TV damage through the mail. How is this prevented?", "input for headphones ??", "How can i get the tv serviced in case there is a problem with the picture. do you have a company to repair tv?", "Does the tv support netflix dolby atmos natively in the app (not pass through)?", "How many inches does the stand elevate this tv?", "How many hdmi port", "Does this tv come with the slim black smart remote, or the standard samsung remote with the numbers and color abcd buttons?", "Does it come with a hdmi (earc) cable?", "Is it fast?", "Does this tv have the apple tv app?", "So many one-star reviews from people that don't understand TV measurements. Screen size refers to the diagonal measurement not the width.", "Since apple tv is built-in? do i still have to buy the apple tv unit if i want apple homekit?", "what’s the refresh rate and does it have vesa mounting holes and what’s size mount do you need", "Are the mounting holes perfectly centered so the midle of a wall mount lines up with the middle of the TV?", "Does this have wireless internet or do you need a wired Internet connection?", "Can I play media files such as videos from usb or portable hard drive?", "What kind of screws do i need for wall mounting this tv? it looks like i need long screws.", "How is the upscaling of 480p (and below) SD content? I have a lot of old movies etc.", "Does this tv have a video camera built in?", "I'm new to this: is streaming built in or do i need a roku? also, what sound bar would be best? thanks.", "What wall mount do i use for this tv", "Does it support Apple airplay?", "Does tv have hulu and disney + app?", "Can i connect a hdmi splitter get more hdmi outlets?", "Can I hook up a clear tv antenna for free tv stations", "Will it work with airplay 2?", "Do you have to setup an account with samsung ?", "Does this model have the ambient function?", "While the Q section implies it should work without internet connection, the reviews say it needs internet. Which is true?", "Does it have a dedicated \"arc\" hdmi plug?", "Is there a way to actually close the applications on the tv or do you have to shut it off in order to close an app", "Does this tv have Bluetooth so that I can use air pods?", "This tv is Bluetooth?can I connect with my aipods?", "I stream everything through by Computer, can I just connect that without using any of the pre loaded programs on this tv?", "Is it hdr compatable", "Can this tv output audio to both a soundbar and bluetooth headphones? My dad has bad hearing and needs audio directly to his ears.", "How long is the power cord for this model and what side is it on if you are looking at the tv from the front? looking to mount it on a wall. thx", "Can I add my firestick to this TV ?", "Is Roku a native app on this Tv?", "There appears to be a hard protector film on the screen. No sticker saying to remove it and no instructions in manual. Is this supposed to come off?", "Is there a floor tv stand that will fit this tv?", "how do i get the remote to turn up the volume? it only mutes or turns back on", "How heavy is this tv", "Can you turn the wifi off if you want to so no EMFs are being emitted?", "Does it have any hdmi 2.1 ports?", "Hello, I need to know what is the box size please? thank you", "Does it connect to WiFi wirelessly?", "Es smart esta tv ?", "What is the warranty for 50\" samsung tv tv", "does it support A2DP bluetooth profile?", "Is this model is hbomax compatible? it's on the list at their site but wonder if anyone has actually downloaded the app and it works.", "Can this TV be safely used on a covered porch?", "Does it have an optimal viewing angle?", "Does this have amazon music app on it?", "does samsung 55-inch class crystal uhd tu-8000 series - 4k uhd hdr smart tv with alexa built-in (un55tu8000fxza, 2020 model) have closed captioning?", "Does this tv support mlb app", "which hdmi cabel is the best to useto usee", "could it be used as a security system monitor", "Voltage? Is it 120-140? Or dual?", "Does this tv have an audio out?", "What are the viewable screen dimensions?", "Can I return tv if I am not happy with picture quality?", "Is the tv good for gaming?", "Is this work in Middle East and is input power is 220 v?", "Does this have the following apps? fandango, fubotv, pluto tv???", "Can this connect to Bose speaker?", "How do you get to basic channels? 2 4 7 9 etc. Thanks", "I see it has bluetooth , will the bluetooth transmit to wireless earbuds or does it just receive bluetooth transmissions ?", "Did you receive a43 inch TU 8000 in the last 3 months in good working order and is still fine?Mine came non-working .", "Does this tv has fire tv built-in or are you able download it?", "Does the samsung 50-inch class crystal uhd tu-8000 series - 4k uhd hdr smart tv with alexa built-in have a camera on it?", "I currently have an amazon toshiba tv and tired of having to switch over to cable every time i turn it on. does this tv startup w/ cable direct?", "Does it work like other Fire TV's utilizing apps to view other things?", "Is bluetooth included", "Is installation included?", "dose this 2020 model carry the new ATSC 3.0 tv tuner???", "My tv came without the base. now this is a hassle to return. how can i get the base?", "How many hdmi ports does it have?", "I'm now 82 years young and my wife and i are still using a rooftop antenna. we've seen this tv, and wonder if it will work via an antenna?", "How many hdmi ports does this have two or three?", "What's the chroma rating of this tv? Also what's the input lag in milli seconds?", "Does this have the fire tv interface? i know it has alexa but i don't understand what interface it uses.", "Does this model have a web a web browser", "Does this support disney plus?", "Does this tv have hdmi 2.0?", "how long is the warranty for the 75 inch tv", "Can this unit wifi mkv movies from a pc on a different floor directly above? thank you.", "Does this model supports pip (picture in picture or split screen)?", "How do i connect xbox 360 with av cords? when i have everything connected and game system on with game and fully powered i get nothing showing upon tv", "I am looking for a app called hotstar. Does this tv support hotstar app?", "does tv have wifi?", "What is the motion on this TV?", "Is this free return?", "will this work with my google assistant", "Will play hbo max", "do the dimensions stated include the stand?", "Why is the 65\" $997, and the 75\" is $1800 ?? Make sense?", "Does this tv run youtube tv? i heard that it does not. please don't guess the answer. please have your answer be fact.", "How far apart are the legs on a 43\" model? Would it fit on a stand that's 32\" wide?", "Do i have to add my own speakers or does this tv have speakers?", "Hi, Have internal speakers??", "where are samsung tv's shipped from, is it from texas?", "is this an non glare ?", "width of stand", "Has anyone used this t.v for gaming?", "How do you get Roku on this TV?", "50 inch tu-8000, what is distance between the beginning and end of the legs on the 50 inch tu-8000 tv?", "Is there a way to select alexa instead of bixby in the voice settings? or can it only be connected using apps? can the remote mic use alexa?", "Can you use with android", "Will heat from fireplace damage tv?", "Does it come with a stand?", "Es wi fi?", "Troubles with Amazon Firestick 4k?", "Hi is this tv 110v", "U can’t add apps to this tv?", "What is the response time?", "Amazon use to provide delivery and setup. Is this still the case?", "So i see earc are for audio set ups, and this tv has an input for it. but i don't care for that, can i just plug in a, say, xbox one there instead?", "What are the benefits of having the built in Alexa can you instruct her to change the channels or go to certain apps?", "is this fire tv", "How do you turn on HD?", "Which head phone match for this TV Is best?", "Does this tv support the spectrum steaming app?", "Does this TV have a remote? If yes, does the remote have a sleep feature?", "Does it support 5g Wi-Fi", "Does it have audio out", "Did everybody get a remote control? i only got a 'kids are us' remote. this is really bush league. does anyone know the model number?", "Can one turn off alexa and bixby? i do not ever want to use them.", "Que generación es", "How is the over the air tuner for receiving uhf and vhf broadcasts? i hear the new sets that are 4k don't have sensitive tuners. thanks!", "Full array or edge lit lighting?", "Does it has HDR?", "I want to buy one and take it overseas, does it work with 220 volts electricity?", "can this be used with a built in home surround sound system?", "Does the 43\" have optical audio connections for a Bose Solo 5?", "Is a vizio soundbar compatible with the samsung tv?", "Is the WiFi 2.5ghz 5ghz or duel band?", "Does this tv support earc?", "What is length and width", "Will this work with echo speakers for surround sound?", "my tv will be 43 inches. What is the distance of the legs and will it fit on a 30\" table?", "Is this oled or qled?", "Can it download the SpectrumTV app?", "will it mount to brick?", "Can I use Wii with this t.v?", "What is the length between the legs? want to make sure my older tv table is wide enough. thanks.", "How to download app on it", "what's this tv Resolution?", "What if i buy it and its broken", "This is advertised with built in Alexis but it’s not listed in the details!", "Does Gsync work on 55inch+ model?", "My TV doesn’t connect with my wireless Bluetooth speakers", "Can i turn the tv on with my alexa hub. I would like to add this to my evening routine, i.e. turn on living room lights, turn on fan, adjust a/c etc", "As much as these TV's cost, why the $%# doesnt it come with the 4 mounting screws for the wall mount? i had to order those seperate", "What is the safe temperature range? I want to put outside in a weatherproof case.", "How many GB of memory ?", "How tall is it with out legs", "Is it compatible with the next gen system? hdmi 1.1 cord?", "Does it have Samsung TV plus", "can i hook my cablebox up on samsung flat screen tv?", "What are the deminsions of the tv.", "I just received a the 55\" model and when setting up I noticed the connector parts seemed loose> Has anyone else had this issue?", "Can I connect it to my smart speaker (cortana-harman kardon)?", "Surge protection needed or built in?", "What is the width of the size between the two stands? I need to know if it will fit on the stand I have and am not worried about overall width", "Does it have wifi Direct option?", "Can you install 3rd party apps similar to a firestick, example vpn etc...thanks in advance", "Does it have bluetooth?", "Is this compatible with the att tv now app? From samsung app store or alexa built in?", "Does this product allow casting from ios or android devices? i have a 6 series that does not cast from ios or android.", "Can i use my amazon alexa devices to control this tv?", "can I connect 2 pairs of Bluetooth headphones? Or is there a limit of one?", "Does it have or work with Disney plus app?", "Is this TV anti-glare?", "Can you watch facebook on this tv cause my tv doesn't have enough memory for it .", "Tiene Bluetooth?", "Will the 75 in TU8000 series sit on a 60” wide tv stand?", "can you download apps?", "What is the distance between the two stands?", "Do this tv have bluetooth headphone connection? thank you.", "if i’m correct this is a lcd and not a led display?", "Can tv be used without alexa. there is no internet or cable service. tv for 84 yr. old lady.?", "Se conecta al iPhone la tv", "is this tv compatible with existing tv stands? I already have one with my previous tv, just trying to avoid buying a new stand", "does it have eARC", "We dont have internet but have unlimited 4g data. Can we connect via bluetooth to watch Amazon Prime?", "I do not see the dimensions for the 75\" model from leg to leg...how wide a table do I need for this TV (just for the legs to fit)?", "Viene con control?", "My tv randomly makes a beeping sound like Alexa even though I’ve turned all notifications/sounds off. Anyone else have this issue and can help?", "I have a 36 inch corner stand. What is the width of the 50 inch TV between the stands?", "Is it possible finance by Amazon?", "How is this tv with glare. Using it in an enclosed porch but glare can cause some issues. I know there will be some glare, any feedback would b nice?", "does it work with 220 volts electricity?", "Is this a 2160p tv", "will amazon install this tv ?", "True weight. -what is the real weight?i need to know for my wall mount every other seller says it's 45.4 for the 65\" and then amazon says it' 62.9 ?", "What apps come with it and can i download more", "How can you mount on the wall together the samsung 85-inch class crystal 4k uhd hdr smart tv (alexa built-in) with hw-q60t soundbar?", "Is it just me or is the picture rather dim at max brightness?", "Does the 50 inch Samsung tv fit on a dresser thats 37 inches in length?", "What brand type speakers?", "Is the TV wireless ?", "Does this TV have built in ads ?", "can you use you tube tv on it?", "Is the power requirement 110-240V?", "Got a this brand new TV delivered today and it has a thick black vertical line down the middle - what am I missing here?", "Does this have chromecast?", "What type of warranty comes with it", "How far apart are the legs?", "Does it support spectrum app?", "Will the built in speakers still play when bluetooth earbuds also used?", "Does this tv help eliminate buffering for prime movies?", "Can i put youtube tv on it?", "Can you get the application shudder on it?", "Does tv have analog audio out?", "What are the dimensions on the Samsung box it comes in?", "Can the TV be mounted on a stand with a base?", "puedo comprarla en usa y que la entrega sea en Mexico???", "On the 65\", what's the distance between the feet from the outside edges of the feet & what's height from the bottom of the tv to the bottom of feet?", "Does this tv have tv plus?", "What is the distance between legs?", "Can I access the hdmi ports once this is flat on the wall without taking it down?", "Can you use alexa to turn the tv on and/or off? specifically from an echo device?", "Cannot get my cable to hook up to this tv. only 13 local chanel’s. i have a screw on cable type not hdmi, any suggestions ?", "Will the Samsung remote allow control of an A/V receiver's volume?", "I am looking for a samsung tv, 50 to 55 inches with quantum dot, 120hz or better, 4k and hdr. what is the best choice?", "Is there a glare from tv", "If i had the tv on web browser and lost power- when i have it back on, will it automatically start-up with the web browser at the same website?", "Can you play Xbox on it?", "Does this have hdmi 2.1 ports or hdmi 2.0? I can’t find it on the specifications", "Can pulsar app be added to this tv", "How sturdy are base legs?", "Can this be wall mountesd?", "Distance between individual stand legs on 50 inch model? the samsung i have now has a center stand. the maximum here is about 36 inches. thank you.", "Can I use cast with other than a Samsung phone?", "Does it support 4K at 120hz?", "How wide are the stands?", "Can i use this as a wireless monitor for work meetings? do i need to use a hdmi cable?", "Does this tv come with the strands", "Why do i keep losing my cable? every time i click out of you tube the screen goes black and my cable won’t come back on. why does this happen?", "What is the input lag?", "For the 43 inch model what is the exact width? i know it shows width as 38 inches but my space is 37 and 5/8 inches wide. really want to buy this tv", "Does it work with google home and airplay ?", "Does stand legs removibale?", "Can this television output sound wirelessly to Bluetooth headphones or a Bluetooth sound bar?", "Does it have Samsung TV plus channels", "Is there an equivalent model w/o Alexa?", "how do I move apps right to left on the home screen?", "Does it work with Google Home?", "Where are the mounting holes for this TV? Are the closer to the top or the bottom or centered?", "Can i use my sony wireless headset and have the tv speakers work at the same time?", "Does it support the xfinity stream app", "How is the wi-fi connection? Any issues?", "Im storing up items for my move. Will i damage this tv if I lay it on its side or upward?", "Why does it take 5 months to get this tv with prime shipping when it's in stock?", "What is the better refresh rate 60 or 120 ??", "How is this tv different from a roku tv?", "Does this tv need a sound bar?", "What is the image ratio?", "Since i purchased this through amazon, do i need to register my tv?", "Does the remote control light up for use at night?", "can you listen to tv speakers and bluetooth headphones at the same time?", "How is the gaming experience compare to 6series tlc tv?", "What cable do I need to hard wire this tv to my internet?", "Do not want wall mounted? Can I get oval stand?", "Does this have support for the Plex App? If so, how is it?", "What is the resolution?", "Return policy for electronics", "I plan to primarily use this for a display screen, for items to display across the room off of my apple pro laptop. can i do this wireless?", "Does tizen have access to the beachbody app, so that i can add?", "Does this work with the home theater option and the echo studio?", "what's the pixel count?", "Is this tv wall mountable?", "Does is come with the google play app?", "where is these tv made?", "Does \"alexa built in\" mean that you do not have to buy a separate alexa as you do with those models which tout \"alexa compatibility\"?", "What size bolts / screens are needed for the vesa mounts for the 65\" 8 series model?", "What is the power consumption in watts", "Does the product ship in a extra padded box?", "What is the Remote control code for pairing to an Xbox One for power on and off?", "Does the tv need to be on to use the Alexa feature? Or can you still use it as an Alexa while its powered off?", "Does it have a headphone jack?", "Is there a way to keep Alexa out? I doun't want Alexa to be snooping in my private life.", "Hdmi hdcp 2.2 compatible?", "does it have a coaxial input", "is it easy to set up to comcast cable?", "I bought this 50\" tv but everything I play in aspect ratio 2:35.1 gets streched. is there no way to play 2:35.1 aspect ration and have the black bars?", "does it include netflix for free", "Does it have Hbo max???", "requested 2 day shipping and was confirmed, no shipment date yet, when will ity arrive?", "I like to use my pc on the big screen in our living room. can i hook my pc up to this tv?", "Is there a list somewhere of apps?", "Does TU8000 have programmable on/off time?", "¿this tv has dolby atmos?", "Is espn+ compatible with this tv", "I\"m a prime member, why do i have to wait a week or so to get my t.v, what about same day or next day shipping?", "Can HDR be disabled?", "Why are there so many bad reviews? This is a 2020 model. Are these break in problems?", "Do it work with wi-fi connection", "Does this model have the full array lighting?", "Are the legs adjustable to change and adjust the width spacing smaller than 33.1 inches?", "Does this tv do 4k at 120hz? the ps5 and new xbox will be 4k 120hz", "Do the rca (red and white) work for audio out? my speakers only have the option of rca or 3.5mm audio jack.", "Can I adjust the size of the print on the guide?", "Any one else have this problem? remote will not adjust volume. they sent me a new remote - still doesn't work for volume.", "Can disney plus be downloaded to the tv apps or will have i have to purchase a seperate 4k streaming device such as a fire tv cube?", "Does the TV have youtubetv?", "The info listed above quotes (2) different refresh rates, one listing says its 60hertz and the other says its 120hertz, so which one is correct?", "Does this tv come with a remote?", "Does it comes with audio option to use tv speakers along and soundbar same time ?", "Does the tv pick up digital atenna signals", "Can this tv output to a bleutooth speaker and play sound through the tv speakers at the same time?", "What is the measurement between the legs on the samasung 43\" tu8000", "220V work?", "Does this tv work with older samsung remote controls?", "Will it work with Dish?", "Will this screen mirror from an S10 phone?", "Does this tv come with an ir extender cable? or an ir blaster?", "Does this model support keyboard programming (bluetooth, wifi, or usb)?", "Does it have smart view for your cell phone?", "Is there a sleep timer function?", "How many hdmi ports does it have and does anyone know which tv has at least 6 or more?", "Does the samsung 50\" tu8000 work with alexa? because one review say no but the description says yes.", "dose this have a ratio", "Can you screen mirror from an I phone?", "What are the black clips that are in the package with the feet? Do they go in the other holes that are in the bottom?", "Does the 55” have an hdmi-arc port?", "Does this tv have the tvplus free tv app?", "Does it have “anynet+(hdmi-cec)” capability?", "What vesa size can i use for table top stand", "Can we share mobile screen in this TV?", "What it the motion rate on television?", "Can i mirror my android phone to this tv so that I may watch on the tv? Thank you in advance", "How can this be Amazon Prime and yet take one to two months to ship?", "Is posible to mont this tv in wall ?", "Can you use this as a monitor for computer? does it have a vga or hdmi connection for a computer screen? how did you connect it?", "This TV has apps, but can you install or does it have the ‘Plex’ app?", "dose it come with a mount?", "Can I use headphone and have tv sound simultaneously?", "Do you have to press the button to use alexa or can you use a dot or phone?", "My fireplace mantel is 10.5 in. Will this stand work?", "For the 75 inch tv, what are the width and hight dimensions?", "Hom many hdmi 2.0/2.1 ports are there? there are conflicting answers.", "Will it connect hdmi to a desktop pc with nvidia 1070 video card", "Is this led? part number indicates it is but description says lcd", "Does this model support Dolby Vision?", "Can you use with a android", "Can the TV be place on a stand without using the legs?", "50 inch samsung", "Are all of the hdmi ports 2.0 for this tv?", "does it have HDMI port 2.2?", "Is it really only 60Hz or is that a typo?", "Can i use roku player with this tv?", "I have hulu streaming service will that work on he 65\" TV?", "Will the TV work *without* an internet connection?", "Can a comcast cable box remote or a flipper remote work with this tv? looking for a simple way for a 93 year old with dementia to work their tv.", "Does this set have Dolby Vision?", "Does the given height of the tv include the stand?", "If i don't connect the tv to the internet (already have a roku device, thanks), will i keep getting reminders or messages telling to set up wi-fi?", "how many hdmi ports for samsung 55-inch class crystal uhd tu-8000 series - 4k uhd? these answers are for a bunch of different tvs!", "Does the Tizen operating system have the Xfinity Beta app?", "Would a 75 Inch tv fit in a 60 intv stand?", "Weres my refund", "Do you have a install and set up service?", "Disney+ does not load, why?", "Does the screen have white spots on it like the area us too bright?", "How do you get youtube tv on this tv? when i add as an app the confirm button does nothing when accepting the terms.", "Can I add wireless speakers to this TV?", "Que sonido tienen", "Will Alexa turn the tv on and off", "Monthly payments?", "Is this tv curved or flat", "Can you play the Nintendo switch on it?", "The e manual mentions one connect which i do not want. \r\ndoes this tv have one connect? if any adds are displayed can they be disabled? thanks", "Es compatible con IPhone?", "What is horizontal width and diagonal width of the 50\" TV?", "what is the distance between legs for 85\" tv ?", "Is this tv has a usb plug ?", "How to activate alexa?", "How do i delete channels that i do not want on my tv? (live tv) \r\ni have the samsung tv model un43tu8000fxza", "how is this for ps4pro?", "Does this have component hookups?", "I have a 2017 model samsung 55 inch \"smart\" tv. the 3rd and 4th digits of the serial number are \"lg\". can this mean that it was made by lg?", "Can you stream crunchy roll?", "Can you add nba league pass and other channels on this tv?", "Have internal speaker??", "is the tv stand included?", "What is the distance between the legs on the 85 inch the legs on the 85 inch?", "Does it have accessibility for the visually impaired?", "My tv arrived today, seems ok, waiting for the wall mount to hang it. downloaded the youtubetv app, and it works, but alexa can't find it?", "How tall is the sound bar speaker", "Does this tv support apple homekit, airplay and have the appletv app? or would i need a separate appletv 4k?", "Can I use this speaker for a q series tv?", "Can you have two gaming console plug in it", "Does it have dolby digital?", "What is included in box ? Does it come with screws to mount the tv?", "What year is this tv is it a 2018 or 2019 or what", "Does this television field support amazon prime, netflix, hulu, and disney plus? what about pandora?", "It does have sound right? Or I need to but that sound bar?", "Does this tv work with echo sub?", "Does it have the ATT uverse app???", "Se conecta por wifi y también se conecta por wifi", "Can I connect my fire stick the tv?", "can this tv go above 60hz?", "Can you access an internet browser or do a Google search on this TV?", "What if damaged during shipping?", "Is it true that you can't remove ads?", "How many watts does the 50\" use?", "Does it have the channels so I can eliminate my Comcast cable box?c", "Can i play movies from my samsung galaxy tab e lite 7\"; 8 gb wifi tablet (white) sm-t113ndwaxar on this tv?", "I don't want Alexa. Can it be disabled?", "Is this 60 or 120 hertz??", "When trying to download apps, it acts as thou6 it's installing, but goes back to saying install. The tv will not download apps such as Pandora?", "If i hang this flat on the wall, can i still access the hdmi ports?", "What is the difference between the tu8000 and tu8200 models?", "Led or lcd?", "What are the shipping dimensions?", "Can this tv work in a vertical orientation?", "Does this have a soundbar mount?", "where is the tv controller on this model?", "Can I attach a pedestal mount on this TV?", "Has anyone had a chance to watch sporting events (ie nfl replays) on this? any blurring?", "Will this 85 inch fit on a 70 inch stand", "Does this tv have Netflix built in?", "Is the tv stand adjustable?", "Is this tv full array or edge lit lighting. I see questioned asked and unanswered.", "Does it have an AUX port in the back?", "What year is this tv", "Crystal uhd vs qled", "What's the difference between 2019/2020 model?", "Can you have it mounted on a console by amazon?", "Samsung 4k 50 inch is this brand new", "what are the dimensions of feet?", "Is the height with or without the legs?", "Anyway to disable the wifi completely on these units? maybe remove the wifi module specific to this model? any details would be appreciated.", "Verizon fios. can you still access the smart tv apps like amazon prime? or are you limited to verizon apps.", "Does it work with amazon prime?", "Is there any replacement remotes for this television available? Looking for something that is backlit and would love some shortcut buttons?", "What is the dimensions without the stand?", "Can the left and right snap-in tv stand legs be removed if i decide to wall mount the unit? if so, how is it done????", "I just bought an apple tv. will this work with this tv?", "What is the depth of the 55\" model? The description reads \"9.90\". Thank you.", "Does the Alexa feature take up more electricity?", "How thick is the TV without the legs?", "Does it have a headphone port ?", "Ok, I tried plugging my stereo receiver into this tv using an optical cord and every time I do it says no speakers detected. Why can’t it identify my", "How do I find the sleep timer on this crappy little remote?", "Can the stands be removed?", "Samsung website says the 2020 model has the tv controller on the back of the tv but mine has it under the bezel in the front middle.", "What is the ac loltage", "Does it mirror to the Samsung smart fridge?", "Can you use Netflix on this tv without a monthly bill, or any of the apps it has downloaded to it?", "Tu8000 can work 220 volt??", "what is the distance between the legs of a 50\" TU8000?", "does it have picture in picture?", "Is this model compatible with Apple TV+?", "Why is the tv so cheap compared to similar TVs?", "Does tv have crunchyroll? my old tv didn't have it in their app store, i have an xbox i usually use, takes long to download other stuff while streamin", "Does it have schedule on / off timer?", "Spectrum does have 4k cable. will this tv work clearly on hd cable only?", "Does it support net iptv app? mine is not finding it.", "Does the 2020 model have composite ports? Red/white/yellow?", "Does this tv have roku app?", "does it have a dtv tuner built in for air signal antenna?", "I just got the 50” tv and it looks like there might be a screen protector on the screen but i can’t get it to peel off. any suggestions?", "Is the 43\" vest 200 compatible?", "can you download apps like CBS or Disney?", "Does the 65' version. have web browser?", "Does the 55\" version have a web browser?", "Is stand adjustable on the tv? i want to move the two stand closer instead of the current length since my tv stand", "opictial eye ?", "Not sure what is happening but i try go to netflix and it will not let me. works w hulu and others but not netflix. any ideas?", "Is this tv hdr 10 certified?", "Can i use this tv with voltage 220-240v???", "Can you download the nfl sunday ticket app?", "What is return policy", "App can you access the xfinity beta app?", "Length and height of Samsung 55 inch tv", "Anyone having issues with video being slightly ahead of audio? (43\")", "I have a tv cart that i'd like to put a tv on. what are the dimensions of the stands?", "Could someone tell me the exact width of mounting holes on the back of the tv ? thanks!", "How long is it warranted for?", "How wide does the stand need to be?", "Does it have the Sling app?", "The hdmi arc on the picture says it is an input. is there an hdmi arc output for plugging into a sound bar?", "What is the distance in between its legs? Can they be changed or is it set at one distance? I’m trying to see if it fits on top of my 39inch bureau", "Does this tv work with hulu live?", "How reflective is the screen? Does it have the anti-glare screen for bright rooms?", "There is a two-toned chime randomly while I’m watching tv but I can’t figure out what it means?", "We don’t have cable, will the picture still look greatest?", "Will Alexa or Bixby help change tv channels?", "Can it stream in 4K from Netflix and prime video ?", "Audio output?? i see where the tv has the digital output but to plug into my rca type of inputs (in my receiver), do i need a prozor converter?", "What is the depth of this 65\" TV; The dimensions show 11.1-really?\"", "Does this TV have a game mode?", "what purchase was my gift card spent on?", "We want to plug in sennheiser wireless headphones for hard of hearing person without disabling tvs speakers. is it possible?", "Buenas tardes quisiera saber si existe una forma de envolver la tv de 50 pulgadas porque quiero adquirir una para enviarlo a venezuela", "If you reverse the stands so they face inward, what's the distance between them?", "Is it compatible with Disney plus with fast buffering speed?", "Is this a 3D TV?", "Is it hdmi 2.0 or 2.1", "can this be hook up to a laptop", "I have the 50inch model - can you change where/how the legs are positioned? Want it to sit on my mantle better.", "do i have to add my own speakers or does this smart tv have speakers?", "Is there a list of apps that are on this tv? for instance, i use fubotv for live television. is that on there? if not, can you add apps?", "Does this tv have cbs app on it, or you can cast (mirror it) to from a website?", "made in usa?", "what is the size table needed to set 65 inch tv on?", "What is the product weight for shipping purpose?", "Does the remote have a Netflix and prime button?", "compatible with directv ?", "Is this compatible with all streaming apps?", "Does this tv read usb and support video playback ?", "Can this tv hook up to a blue tooth speaker system and play on all the surround sound speakers... supposing the surround sound speakers are Bluetooth?", "Q:TV must fit on table that is 27 inches. Will this tv fit?", "What are the dimensions for the 65\" tv with out the stand?", "Ok. So i have a wall mount that lines up with the screw holes but the screws are way too short and don't fit the holes. What size screw fits in this!", "Does this unit have volume balance? Stop volume from increasing during commercials?", "How is the picture if it’s under a shaded patio?", "for the 43 inch model, how far apart are the legs, measuring the widest points. I need to fit legs on a 37 inch table?", "will the smart TV platform allow spectrum TV app for streaming ?", "I know it has alexa built into the remote but can you also use your existing alexa devices (like the echo dot) to control this tv hands free?", "What does Amazon certified mean?", "where can you get a list of apps? i want to make sure it has hulu live.", "Funciona a 220?", "Is this a 50” ? Someone said it’s not, that it’s a 44” and it’s a scam!!!", "How wide does my TV stand need to be?", "What is the weight of the tv itself on the 85”?", "Can I control this tv with my kindle fire?", "How wide apart are legs on the 65 inch version?", "Does it have optical", "any problems with wifi?", "Can i stream from my ip or cell to thw tv , i will need hdmi cable???", "The TV has a Google assistant ?", "does the tv support airplay?", "How do you make alexa work? i enabled it on the tv, linked to my amazon account and enabled the smartthings skill on alexa.amazon.com. still nothing", "Can you get peacock as an app and Apple TV plus?", "The product description for samsung 65\" un65tu8000fxza on amazon says it has 2 hdmi ports but the description at samsung says 3. so which is it?", "Can I connect two sets of wireless headphones simultaneously to this TV?", "does this tv use ccfl like the older LCD ?", "Is disney + supported on this tv? is there an app for it?", "Having this tv delivery can i have the delivery persons move my old tv to a different place", "Is this Comcast infinity beta app compatible ?", "What are the speakers power ratings and how many usb ports does this tv have?", "Why does the description say this tv has two hdmi ports and on this model there should be three", "Will i be able to use roku, tubi and youtube on this television?", "what is the actual depth of the tv without the stand?", "Difference in led and lcd", "Does the Samsung tu8000 model have YouTube tv app on it?", "Can you completely disable the Alexa functions, so as to preclude the possibility of external eavesdropping or recording?", "Why is this series so much less expensive than the UHD line or whatever the 2020 q80 is?", "Can i bypass roku so I use my TV antenna", "Where can I find a list of available apps for this television?", "tiene wi fi", "Does this model come with apple airplay 2 preinstalled (don't need separate apple tv device)?", "Cuenta con puerto hdmi compatible para las nuevas consolas como play 5 o xbox x series.?", "Can this smart tv allow you to do drop in on other Alexa devices", "Does it come with a safety anchor?", "Does it come with an hdmi cable?", "Can I connect my AirPods to tv without any other equipment", "Does the apple tv work with this samsung tv?", "What is the refresh rate?", "what is the leg spacing on 50 inch?", "Does it have a Disney+ in the Facebook app?", "How much does this weigh?", "does it have smart view?", "can someone tell me the exact width of this tv? It has to be precise thanks", "What series is this one?", "65\" TV making sure it will fit my stand. What is the distance from the outside edge of the left leg to the outside edge of the right leg?", "Can a dvd and VCR player be hooked up to the tv?", "What is the stand dimension? Distance between the legs?", "What is the distance between the legs on the 55 inch?", "Product description for samsung tu-8000 on amazon says 2 hdmi ports. other websites say 3. which is correct?", "I just received this tv and notice there seems to be a film on the screen but I can’t tell if it’s supposed to be removed or not?", "Can i still use the amazon recast DVR with this tv?", "What is the distance between legs of 65”Samsung tv?", "It is work with 220V?", "What are the actual dimension for the 55\" model? I want to put it in our RV and have an available space of 59\" wide x 33\" tall", "What is the exact width of the stand the 65 inch comes with?", "Able to watch netflix, amazon prime, disney +?", "Whats the refresh rate ?", "Can you connect wireless speakers to this TV ?", "What is the distance between legs on the 85\" model?", "Is this a full array with local dimming or edgelit?", "What is the price for this ?", "Can I link and view peloton screen on this tv?", "Does it have an antenna imput", "What is the distance between the feet on the 50-inch TU-8000 Series?", "How do you you remove apps from the smart hub menu", "is it 2160", "This question is very important please, is this tv hdcp 2.2 compatible? i have an hdmi hdcp 2.2 cable and need to know if this can support 2.2?", "Compatible with the echogear universal stand?", "How far apart are the legs on the stand?", "what is the vesa pattern?", "Is remote the same frustrating minimalist remote with no FF or Reverse buttons as in older models?", "Does this picture change or wash out as you move around the room? i’ve noticed this on a recent uhd /4k i bought, and it’s driving me crazy", "I was told if this tv is left on for a long time, a burn-in picture will result - is that true?", "Is this tv back lit?", "On the samsung qn43q60rafxza, if you press the mute button, does the mute icon stay on the screen and dance ... or does it disappear after say 5 sec?", "Does it included one connect?", "I hate my new roku tv, because i cannot pull up fb to watch all the concerts and church as i used to! can i do that with this tv? does it allow you", "Is this model tv compatible with sony soundbar?", "What are the actual dimensions of the tvs wthout the feet for the 75 and 82 inch models", "Does the stated height of 22.2\" include the feet? If not, what is the height including the feet?", "Can i buy it in the south Korea?", "Can you confirm the tv will reliably output dolby digital 5.1 over optical connection to a sonos playbar with no issues?", "is there any picture degradation with streaming wirelessly", "Does it have air play", "Does it have a flat or curved/recess back?", "Is there a non-generic \"user manual\" for this product? (the link below is for an e-manual -- as if no specific product manual is available). tia", "I have a Sonos sound bar on my old television. Will the installation include transferring and attaching this to the new television?", "Can I get the Peloton app?", "I need legs that are not so wide to fit on fire place mantle is this something that can be done? 10 inches in width", "Does the 82 inch q60 have earc input for dolby atmos?", "I am not a gamer. just not my thing. gaming is mentioned in a lot of reviews. would i be better off with a less expensive samsung 4k uhd model?", "Does this TV offere Picture in picture?", "Can anyone tell me how to connect this tv to my receiver ? Also I cannot get the Roku or my other devices to be operate.", "Im from uk would this tv deliver and work properly over here?", "Whats the motion rate?", "Supported surround sound is dolby digital plus. if using an a/v receiver with arc does the receiver need to support dolby digital plus?", "Does this tv look better then dolby vision or does it have dolby vision", "This tv has a bluetooth connection. Does the connection allow for bluetooth wireless keyboard?", "Does this tv have an on timer? (sometimes called a wake timer)", "For gaming is a qled or qled tv the way to go? i mean when i hook up my ps4 pro and xbox series x when it comes out", "Does anyone who owns this tv use the youtube tv app as your cable provider? i heard some negative reviews with buffering on samsung tv's?", "Can this tv's legs be removed and place the tv on a glass pedestal type stand like on other samsung models?", "Does the 82\" have the tvplus app?", "Is there flash lighting or stutters in this tv or slightly noticeable motion Artifacts?", "Tiene función airplay con iphone?", "What year is this TV?", "What kinf of voltage converter i need to buy to use it in france? somebody can tell me? thanks", "Vesa for 65\" shows top mounting holes on curved part of back? is an adapter included with the tv so those holes are level with the lower two?", "Does the smart hub have Disney+?", "Does the 43\" support wall mounting? If so, is there a specific one to get?", "Can someone from the vendor (samsung) confirm the refresh rate? according to the spec of the model in samsung, it should be 240 but here it says 120.", "Whenever a really dark scene comes on, the TV automatically gets even dimmer. Is there a way to stop that from happening?", "Does it come with a wall mounting bracket? And would it be too much trouble to get one that’s recommended? If you aren’t too busy of course.", "Does this tv have the apple tv built in?", "I need the power cord to go with this tv, which one is it?", "Is it ok to wall mount on a brick wall?", "Can you hook up a dvd to this TV?", "Is there any way to fast forward or reverse on this tv while viewing YouTube or other internet content?", "What is the outside width of the 43\" and the 49\" models?", "Is the height measurement (41.4 for 82''; 38 for the 75'') on the stand or just the TV?", "How far is the screen from the back of the stand on the 65 inch model?", "How many hdmi connect", "I need just to connect tv at home are you doing thst", "Is this TV Fubo compatible?", "Do these have auto-volume or sound-leveling to stop commercials coming on blasting loud?", "What down and out tv mount do i need for samsung qn65q60rafxza flat 65\" qled 4k q60 series (2019) ultra hd smart tv", "Can all bluetooth devices connect to this TV (or only audio ones like some other Samsung models)?", "Will my 48 inch wide stand hold this 65 inch tv ,", "Is there a way to connect the audio output from this television to a older composite/component home theater/stereo system?", "Will I be able to use Amazon Prime video?", "Anybody else have loud popping noises when turned on then once it’s been off for awhile?", "Does it support hdr10", "Will this tv work if it is not connected to the internet?", "Is the motion rate of the 82 inch 240?", "Does this TV have an Aux port?", "Does this support the steam link app? I bought a tv from samsung that said it was supported but it wasnt.", "How many out hmdi, how many hmdi in does this tv have", "Can i watch youtube tv with this model or do i need additional equipment?", "Can you install disney+ on this tv?", "how wide the tv?", "What is the refresh rate of this tv?", "How many rear hdmi ports are there?", "how do you get rid of soap opera effect", "The 49-inch can hang with no-gap wall mount?", "Where is the recepticle at on tv", "can this tv be powered by a 50hz 230vac socket?", "Can this tv be used without internect connection with an antenna for local channels only", "Need help to bring tv inside and connect. How much that will cost?", "energy star approved ?", "Does this tv have Roku on it?", "Is it hdcp 2.2 compatible?", "What is the warranty? Sams Club says it is 5 years.", "The prices includes customs duty or not", "Does this TV support native 120hz refresh rate at 1440p?", "Are disney+, sling, cbs available on the smart tv app? I currently have a samsung and it only has netflix and hulu 😞", "What is the size of the screw that attaches the legs to the TV?", "Does the 65 inch version have Free Sync?", "Do i need a sound bar for this tv? if so which soundboard should i purchase?", "Can this tv be used in Japan AC100v 50hz?", "Cuanto mide el pedestal / patas / base de la TV. Ancho y largo?", "How to enable hdr+ mode. Can't find it anywhere on picture settings.", "Is there an hdmi output so I can hook up my projector?", "Is it better than led 4k hdr", "Can somebody guide me to the wall mount for the model qn82\"? i bought 2 different wall mount but none of them seem to fit with this tv,", "How loud is the tv.", "Does this tv have Apple airplay?", "Can I pair bluetooth headphones to this television?", "How many hdmi ports does this have?", "What is the weight f 82 inch qled samsung tv?", "Does it have an AC adaptor or just a cord?", "How many years this TV has warranty?", "who is the seller does make me third party owner?", "If you are mounting on a wall, is there anything extra needed other than the wall mount?", "Does this have a Bluetooth feature for headphones or speakers?", "Does this tv have Airplay2?", "Will this be ps5 compatible to take advantage of the upcoming upgrades", "How many hdmi connections?", "Can I mount over fireplace", "Does it have a power brick?", "All together how many hdmi ports and how many usb ports are on the 75\" model?", "Clean Cable Solution Neatly manages cords for a crisp, clean look", "Is it Spectrum compatible?", "What is the depth with the stand for the 43” model?", "Can this tv work 110volt?", "Does the menu system serve up advertisements from Samsung?", "Whats the distance between the legs (outside to outside of the leg) on the stand for the 75\" model? My stand is 45.5\" wide.", "How do you watch in 4K?", "How can i change the location of the tv? i can't download applications, etc because it doesn't support the location. thanks!", "Does this tv support ARC via hdmi?", "does the television have an ambient mode?", "can you hide the cable in one of the legs?", "Will this tv work without internet access. Just with air antenna", "What is the native hertz refresh rate for the 75\" Q60 tv?", "What is the contrast ratio?", "How much voltes is it support? Is it support 220 Voltes?", "How big does the table need to be for the 65 inch tv", "No incluye los tornillos y he comprado varios sin suerte . Por favor alguien me puede decir donde compro los tornillos .gracias.", "Why cant touch TV be mounted over a fireplace ?", "It is my intention to connect this tv to an av receiver. i am wondering it is possible to completely shut off the sound from this tv?", "Does it come with the google playstore?", "can televison be shipped to Postal Box number rather than hone address", "Does the tv have a micro hdmi?", "cost of install", "Hi, can i use this tv outside usa , if i want to connect it via hdmi to a receiver that is wired connected to a dish? is it compatible with secam", "Can it steam xfinity through app", "How wide apart are the feet on the 49\"?", "Does it work with Alexa", "How high are the leg stands from the tv? How many inches are there from the bottom of the tv to the bottom of the legs?", "What are the shipping box Dimensions?", "How much power does this 65\" TV consume? The specs say 80. 80 what?", "Remote control battery opening", "Using this wirelessly with internet but would like to attach digital antenna for local channels. Do I need the amplifier that came with antenna?", "Can you turn off or disable Bixby?", "Says 2019 82\"qled has box? 2018 82\" qled does not? what box is this? please tell me about sound system in themty.", "What is stand width outside distance from each legs", "No llegaron los tornillos para instalar la TV en la pared. Que hacer?", "Does this tv have a hdmi output to play sound through my sound bar?", "For the 65\" qn65q60rafxza, the top of the listing under details, it notes the refresh rate as 120 hz. in the description it notes 240 hz. which is it?", "Does it ship from the united states?", "Does this tv have a camera", "Does this 2019 qled use a one connect box or did samsung do away with that?", "Is the 82 inch model hdcp 2.2 compatible?", "Can you shut Brixby off for good? Is it differcult to do so?", "Does this play mp4's (from an usb drive)?", "If i buy this tv right now can i pay extra to have a team install it ? i want to have wires hidden and normally i would do myself but i’m injured", "Do you also retrieve my old TV upon delivery?", "Do the netflix and prime video apps support 4k?", "I purchased this tv from amazon warehouse. does amazon warehouse offer a protection plan for this tv?", "Can a 4k tv play a Blu-ray disc player or do i need to get a 4k disc player. Edgar S", "If you use ambient mode, is similar to art mode on the Samsung Frame Tv pictures?", "Is there much color washout when viewing from an angle?", "I hear some of the newer tv's have a curved back. anyone know if this one needs a adapter for back or will it work with universal vesa wall mount?", "Does this item come with a Voice Remote?", "Is it possible to get another remote for this tv?", "Is it a new piece of used/damaged and Whats the return policy , is it going to be free return", "Tv tilted on wall mount", "What is the width of this tv", "can i control this tv from my PC or laptop (win7 - win10)", "does it have component video inputs?", "The tv come broken", "Is it possible to get 5.1 surround sound if hdmi my fire tv stick or gameconsole > tv, and then use the tv optical output (spdif) > 5.1 receiver?", "Is it possible to schedule same-day delivery and installation?", "Could someone measure the distance between the stand legs on the 65\" samsung q60 series? i need to know if the legs will fit on my tv stand, thank you", "How can i tell if this tv is chroma 4:4:4 or not? i don't see it listed int he specs.", "How far apart are the legs on the 43 inch model?", "Do you need 4k cables ( if so what are the best ones to get ?", "Are the hdmi ports hdmi 2.1? new gaming councils and future devices all will be hdmi 2.1", "is there a center stand option for this?", "How to connect to Alexa?", "Work with Alexa?", "Is this a smart tv that can access netflix and amazon prime apps?", "What is the diff between q60d - qn75q6drafxza vs q60r - qn75q60rafxza", "Does this tv have built in speakers or do you have to buy a sound bar?", "is this tv blue tooth?", "does it have a 3.5 mm audio port in the back?", "Does the tv have a reset button?", "Does it have a recording function?", "Does this TV use a pointer on the remote to navigate the screen and enter text, or do you need to scroll around with the arrow buttons?", "I am from sydney australia, will I get sent a tv from amazon.com with the correct plug and voltage?", "Does this tv have 5ghz wifi?", "Does this tv have arc hdmi to connect to a reciever?", "What's the shortest distance can I watch this from?", "Can the 82\"be wall mounted?", "my husband is hard of hearing so I have to purchase wirless earphone. I can hear and will need to have the sound. Will this tv do both?", "The non-qled uhd version of this tv (un43ru7100fxza) is half the price ($347 vs $697). is it really worth to pay double? why?", "Does this TV have the refresh rate 240", "Does this tv have a built in DVR?", "Is the volume loud on it.", "Can i connect my bluetooth headphones with this TV?", "Would a 82\" fit on a 60 inch tv stand?", "How many hertz does the TV have?", "is this Vrr/LFC enabled?", "Is there a center mount for this tv", "Is it true the bigger screen u buy the pictures comes a little more blury?", "How far apart are the legs on the 49-inch model?", "Does it work with the no-gap wall mount from Samsung?", "How is this 72\" it says butits a 82\" tv", "Can it work on 200-220 V power supply?", "How many hdmi ports does it have?", "What is the return policy", "Does this tv have direct input selection, or do you have to toggle among the various inputs to select the correct one?", "Puedo comprarlo a pagos mensuales?", "Can i use my comcast remote on this tv (instead of the one provided with this tv?)", "Size is measured from corner to corner, yes?", "Is this actually 4k? says it upscales content to 4k, not native 4k", "If the box or the tv is damaged how do we return it and who pays for return postage?", "What is the difference between the Q 60 series in the Q 70 series", "Stopping the \"Connect this device\" dialog - This dialog pops up every few minutes asking to connect to someone else's device - Any ideas?", "Will this (and if not which model) work with my echo speakers and subwoofer wirelessly (not just to ask commands) but to play the TV sound?", "Does this TV have the capability of apple airplay 2?", "Is the Samsung Q70 worth the extra money ?", "I have a mount (currently using) i think it’s put to 70inch. does anyone know or think i will have a problem using it for this tv 75in??", "download pdf manual instruction", "Is it Free return?", "Can the 82\" Q60 be wall mounted, i'm seeing reviews that it can't be?", "What’s the distance between the leg stands on the 65”", "Ďo all oled tv have apps", "shipping cost", "Xan this be wall mounted?", "On the 82\" tv, what are the height of the legs? or what is the total height of the tv including the legs?", "Can you control this television with your smartphone?", "How far apart are the legs for the 65 inch version? I want to see if I need to get a new entertainment center for it, thank you.", "Is the Motion rate 120 or 240 for 75 inch Samsung’s website says that this model is 240?", "Whats the distance between the legs on the 43 inch model? My tv stand is 40 inches wide.", "How tall is this item?", "What is the refresh rate of this TV?", "What size mountimg screws for the 82\"?", "What is the distance between the leg stand feet on the 65\" Samsung Q60 Series?", "Can I have it installed", "What video formats does this tv support via the usb/network connection? my older samsung supports a wide variety of formats that this tv doesn't.", "stand How far apart are the stand legs on the 82 inch Q60?", "Can i use my old samsung remote from my old 2014 un40h6350 model or the remote from the 2018/2019 un43ru7100fxza?", "Do i need to get a fire stick for the tv? if so which one should i purchase?", "Is there a warranty ?", "Internet listo?", "is white glove service available at delivery? with extra costs?", "Does anyone have 2+ components connected to an audio receiver and then receiver to the tv and the tv remote working for everything?", "Can i get a longer power cord?", "is there a big difference in q60 vs q70 series? is it worth spending 200 bucks extra for q70?", "Do i have to set anything on my qled samsung to play hdr movies and if i do then please tell me how.", "My airpod pros connect to the bluetooth feature of the tv just fine, however the maximum volume i am able to get is very low. any ideas as to why?", "How do i exchange the money to Kenyan money", "Does the backlight and contrast need set at maximum in a daylight room?", "do you have purchase mounting adapters to put in vesa holes in back of tv to mount on wall?", "How many years is the warranty?", "does this tv have picture in picture", "Does the 65inch tv on the stand fit on a 40 inch table", "Comes with curved screen", "Can this monitor turn on automatically once power is supplied to it? example: can it work like a pc monitor?", "What is the warrenty", "does this fit to australian plug & voltage ?", "Does this TV come with a mounting bracket or is it sold separately?", "Does the q60 have lfc? it does have vrr. but i can't fint if it has lfc.", "What is the distance between the stand legs for the 75” tv ?", "how far apart are the legs on the stand of the 43inch?", "what is the distance between the legs?", "Does is support hdmi arc for soundbar?", "Whats the distance between the legs (outside to outside of the leg)on the stand for the 75\" model? My stand is 60 wide. wanna see if it fits on the", "How is this tv for general web browsing? is it slow? are additional apps needed as well as additional peripherals; like a wireless keyboard, etc.?", "I see most blue ray & online 4k content is coded with dobly vision, so are all you samsung purchasers comfortable you will never have that function ?", "Are there any other compatible alternative remotes you can use?", "Does this Qled tv really make that big of a difference in picture quality for watching live fast moving sporting events and is it worth the xtra $ ?", "What tilting mount is recommended?", "Lg has an iptv app with hundreds of free channels, does samsung have the same?", "does this tv have digital audio output (optical)?", "The 65in how How much does it weigh", "Does this TV have a built in receiver?", "How high is the tv from the ground", "That is the sale price every where y’all supposed to be 50%off of that", "Over all dimensions?", "What is the distance from the top of the unit to the upper bracket mounting hole?", "Is the closed captioning easy to use on this TV?", "How many hdmi ports?", "what is the voltage? I would like to ship to hong kong - how would it work?", "what is the difference between qled and oled?", "Is this tv bright enough? from some of the reviews they were saying its not as bright as last years model. thanks", "Does this tv come with feet?", "Does this model have a 3.0 USB port?", "Can I use zoom with this tv and if so what external device is needed?", "Can you use Bluetooth speakers?", "How good is the tuner for antenna reception in a marginal location? I already have the best set up of antenna array/ preamp/ amp/cable.", "What is the width of the legs of the 65 inch? i need to see if it can fit on my current tv stand.", "Does this work with Amazon firestick?", "Does the tv support usb hdd?", "Can it support 230 voltage?", "Works with MHz connection", "As i'm reside in indonesia, can this tv tuner be changed to dvb-t type? will it impact the 4k resolution or picture quality in any means?", "Is there a \"center stand\" option for the 82 inch tv? all the center stands on amazon state that they only go up to 80 inches.", "has anyone used the Bluetooth Headset Support?", "What do I use to hook up dvd", "How far does the stand extend past the front of the tv", "what is the warranty?", "Can a sound bar and Bluetooth headphones be used at the same time?", "What is the measurement from stang leg to stand leg? My table is about 55 inchs", "What's optimal viewing distance from screen?", "On the 82” TV what’s the length between the leg stands?", "What the 82 inch fit on a 44 inch table stand?", "Why can’t this be mounted above a fireplace?", "How far apart are the legs on the tv?", "Where is this TV manufactured?", "Is this model compatible with the no gap wall mount?", "Does the TV need to be on to access Alexa?", "Will the fire tv cube work with thi ssamsung tv?", "How durable is the screen? Would it be ok to use as a touch screen?", "Does this tv have a channel tuner?", "8bit or 10 bit?", "Is there a youtubetv app that works on this tv for watching youtube's cable service?", "On the qn82q60rafxza, how deep are the feet that it comes with?", "How many hdmi ports does it have ?", "Does this have apple tv and/or disney plus built in?", "Hey, if i am going to be hooking this up to a ps4 pro, would a qled be better for gaming or an oled tv? i am not sure", "How far apart are the wall mounting holes on the back of tv to mount the brackets", "como si es bi-voltios (110/220) ??", "Does the tv have a optical output?", "is 120 Hertz?", "Can I get this TV setup not wall mounted\"", "does it have a stand tv on ?", "Does this Samsung have Dolby Atmos?", "Are all of the connections on the back panel? I can't find a good picture of the back of the TV.", "Can you cast directly from an android phone to the tv like those with built in chromecast?", "How many inches are there between the bottom of the tv and the bottom of the tv stands?", "Can anyone definitely say if this is a 120Hz or 240Hz refresh rate? I see conflicting information", "Will this connect with my Samsung phone via the Smart View?", "Do you need to change your cable device to 4k.", "What brand of battery ships with the Samsung TV remote?", "Anybody used to bought this 82\" please let me know if it come with the wall mount?", "Will this tv be good for ps4 pro?", "How many years warranty on this tv", "Does this have Bluetooth 5.0, or is it one of the older versions?", "I am prepared to order tv. I need item shipped on 16 July 2020 at 0900 east cost standard time, and not sooner. Is this possible?", "How many hmdi connectors does the tv have", "Quiero una plasma de 32 pulgadas cual es el precio que me dice4945 ese es el precio", "Height with stand for 43”. Is it 22.2” or is that the measurement of the tv alone?", "Estos tv traen garantia de 1 año?", "How far apart is the gap between each foot of the stand's legs? how wide does a table/credenza need to be to support tv set?", "What smart channels come with tv", "On the 82 inch How far apart are the foot stands?", "If this is connected to a computer would you be able to go into settings and make the display much smaller? Shrink it down?", "Where can I purchase base / legs stands for a 82in tv?", "Does this tv work with my samsung refrigerator modelrk28k9580sr/aa ?", "Can anyone actually confirm how far apart the legs are on the 82 inch version of the samsung qled tv? are there 2 slots positions?", "Is this no longer available for payments??", "Cbs seems to be blocking content from my iphone. can’t watch colbert. are there copywrite issues?", "How far apart are the 65\" models legs?", "What is picture motion rate", "Can i buy an extended warranty contract with this tv. if so, how much?", "Do i need a fire stick if i want to watch amazon or is this capability already built into the unit? i plan on connecting this tv to my router.", "How thin is it? No side picture", "What is the distance of the legs lengthwise and depth wise on the 82\" tv?", "is this TV 3D as well?", "Power cord length? And the side of tv its on if looking from the front?", "Does samsung offer a remote which has more complete funtion key layout?", "Hello, how can i change the tv's region? i can't seem to download netflix or anything. any help would be much appreciated", "What is the speaker power out", "Does this have earc??", "How long does the limited time offer last ?", "Can i use frame from 50\" tv?", "How wide of a table do I need to support the legs on the 49\" model?", "How many hdmi inputs are uhd 2.0?", "Will this work good with an i7 computer with geforce rtx2060 ?", "I have a Blu-ray disc player ,can i attached a 4k cable to get a better picture. Edgar S", "Are you able to block apps? Make them require a pin to get in to?", "Can i pair my auvio wireless stereo headphones with this device?", "Do I need a cable to connect to the internet?", "How do log into an app? Like prime video", "does tv remote control av receiver volume via optical output so you only need the tv remote and not the receiver remote??", "Is this the Q60R?", "Why does it not say smart tv?", "We’re having problems with the tv thinks we’re asking a question when we aren’t", "Samsung qn82q60rafxza flat 82-inch qled 4k q60 series ultra hd smart tv with hdr and alexa compatibilit this tv work on 220 volts as well? for europe?", "Does this model have USB ports?", "It won’t let me ship it to my house and has no suggested pick up or shipping addresses. How do I get it???", "Does this tv have or support the beachbody app?", "How can qn65q60r remote control case be opened?", "Would i have to purchase a chromecast to view 4k youtube content or is this included with the bult-in assistant?", "Does this tv support for apple itunes? apple movies?", "How do you cast from an iphone? not airdrop that it ties up my phone but cast! like sony tv", "Can you cast directly from your iphone? and/or use airplay?", "I have hearing aids that connect with bluetooth. Can this output bluetooth and optical out simultaneously?", "Does this tv require internet to set up and use? smart tvs are notorious for having terrible security and privacy.", "Can Bixby be disabled or removed ? I wish samsung stop adding it everywhere", "Que tan cierto es que se frisa la pantalla", "Is there more than one place the legs can go like closer in? We need to seton a stand until our fireplace is built!", "Can you deliver it to south Korea?", "Will i be able to attach a pedestal tv mount with swivel feature?", "Can you change the size of the picture on this TV?", "will it work with alexa?", "What is the distance from the top 2 mounting holes to the top of the TV?", "What is the refresh rate?", "how wide are the legs", "I have a 55 inch samsung the span of the legs are 38.5 inches and the width of the legs are 10 inches. What are the dimensions on the 82inch Samsung ?", "I received my tv with only one stand instead of 2. How can i receive my other stand?", "On the 65\" Qled q60 whats the distance between the legs pn the stand?", "Bestbuy specs show this dosn't have a built-in mic, but you can use voice with the remote. but i see reviews talking about bixby popping up \"hearing\"?", "Does this tv support hbo go?", "Will this tv allow my Sony wm1000x3 Bluetooth headphones to work and at the same time have the tv speakers work (not muted) ?", "Dose this TV have the Spectrum app??", "Were there flex paying plans on TV's last week?", "What is the pixel density?", "Does it have alexa built in. Or do i have to buy an alexa device?", "is it 110 or 220 watt?", "Does this tv support hdmi ethernet channel functionality?", "Does this tv have the spectrum app?", "Product dimensions say 38.2 inches, not 43 inches. Which is it? Need it to fit in 40 inch space.", "Does this tv have a 5-year warranty? the same model on sams club claims a 5 year warranty.", "What is this tv's vesa size?", "Wiill this tv work in india?", "Looks good but I don't like the flimsy v type stand. Where can you buy a better stand maybe something with wider (front to back) and better ?", "How far apart are the legs on the 75”?", "legs: What is the distance between the stand legs for the 75” tv ?", "Does this tv support the hbo max app?", "Donde están los tornillos para instalar mi Samsung", "I bought the 43in. qn43q60rafxza . is there a replacement center stand instead of the 2 legs?", "What type of dvd player goes with this tv?", "Does this TV have a camera in it", "Is this Qled TV good for watching live sporting events with fast movement?", "Does this tv have hdr plus", "I just purchased this TV two weeks ago and the price dropped. Will you refund the price drop difference?", "Can it be used as just a tv without the smart functionality or do i have to log in in order to use the tv? it will only be hooked up to an apple tv.", "Do I have to purchase wall mounting bracket if I order it with expert installation?", "Will the remote control operate volume on a receiver?", "why is not great quality picture", "Is it 240hz?", "Does this tv have dual wifi", "Can I tell alexa to switch from netflix to amazon prime?", "What is the actual inch size of the tv not the screen?", "Will it work with Google?", "Is the tv microphone easy to spot? i'm sure there is an alexa toggle in the menu section, but i want physcially stop her from listening in.", "Can i use my omnimount oc120fm for this tv to mount it in the wall?", "will the samsung smart remote sync with a cable bob in order to eliminate the need for two remotes?", "I put this in my cart for 798 and when i went to check out the price went up almost 100 dollars why?", "what is the distance between the legs of the 82\" model?", "Does it have hdmi 2.1 for future tech. like for new playstation 5?", "How did you get it to pair with Alexa?", "What is the difference between 2018 and 2019 models?", "What size cabinet will the 49\" fit on?", "what Wall mount kit is needed for this tv?", "Can this be bought new", "For the 43\" tv, how many inches is it between the leg stands? thank you!!", "Does the 75’’ come w feet / legs / stand anything to set on a console top? Ty?", "How high does the stand raise the 75” tv ?", "How far apart are the legs of the television and can they be adjusted? I have a base that's narrower than the television.", "How far apart are the legs on the Q60 75 inch?", "On the 49” how far away should we sit to view it?", "Wondering if this will fit on my tv stand does anyone have dimensions on just the legs of the tv how far apart they are?", "How can you activate the \"multi output audio\" option in settings, with optical audio line attached, it's grayed out, not accessible. qn49q60rafza", "How long is the power cord?", "How many nits in the 82\"?", "What wall mount did youll purchase? I want to make i i get a good one.", "Is alexa able to turn this tv on?", "How better is this model compared to last year's (2019) Is there a big difference?", "Is there a No gap mount for this tv?", "I'm sorry if this is naive, but do you have to use the Alexa feature?", "How do you mount on wall?", "is alexa built in to all frame tv or just the ones on Amazon", "Can you add an SD card or anything for additional storage?", "Does the art stay on even when you aren’t in the room. I’ve read something about faulty motion censor???", "Does the 2020 one connect box fit into the recess on the rear of the tv panel?", "How would this work in a bedroom if you don't want art shining in your eyes while trying to sleep?", "can you connect to an external Bluetooth or an external speaker with cables?", "Can i mounted the tv with the \"no gap\" mount on a stacked slate fireplace? the stacked slate is varying and it is not a flat smooth area.", "how long is the cord?", "Is there an ongoing monthly cost and how much is it?", "What is 75” frame TV’s refresh rate?", "I'm going to have this mostly connected to my htpc on one of the hdmi inputs. will it switch to art mode when the htpc sleeps/input signal stops?", "Can jack pack be located behind tv in enclosure?", "My cable jack and power outlet are right behind where i want to mount this tv. will the no gap mount accommodate this?", "Is this a 4:4:4 chroma tv?", "Will this show photos from my Google photos? Does it allow for album selection?", "Is a black bezel included standard?", "Does it include E-Arc?", "Is anyone able to provide the exact measurements of where the vesa holes are located on the backside? i need to know to pick out a 3rd party mount.", "If you are using purely for pictures and not for TV, do you have to connect to the one connect box? Or can you just connect to power?", "What is the storage size of the TV? How much free space is left after all the buit in software?", "Can you get rid of the ugly Samsung logo on the perimeter of the frame?", "Do i need to use the supplied mount that comes with the tv? i already have a samsung 65” tv articulating mount", "does this tv have an ethernet connection?", "what are the dimensions of the actual TV panel (minus the stand?)", "Does this come with the black frame?", "How does this hang on the wall? Is the mounting bracket included?", "vesa mount?", "Does it have TCL?", "Has anyone tried mounting on a natural stone fireplace above the mantle? Wondering how compatible the \"no gap\" bracket is on a slightly uneven surface", "how much storage for personal pictures for the art mode? can you use over network or usb?", "I want the beige frame", "The frame turns off when Alexa plays a song", "What’s new and or improved in the 2020 model? only thing I can see if support for google and Alexa vs just Alexa", "What is included in the box, under TV only; does it also come with the black bezel as default?", "Does the 2020 come with mounting brackets?", "What are the dimensions of one connect box for the 50\"?", "Does this TV have the spectrum app installed?", "How long is the thin wire cord?", "Does if come with cords? How are they hidden?", "Does the thin wire also supply power to the screen?", "What is the resolution of the 32 inch one? I've seen varying reports of full hd and 4k.", "Does this tv also come with the stand?", "One of the answers says it ships with the black bezel frame but it seems like it is an add-on at additional cost when ordering. Which is the case?", "Will it “slideshow” pictures?", "Where is the power button on the actual tv? our remote is working but it isn't turning the tv on. i think we probably got a defective unit.", "How long is the default one connect cable that comes with the tv?", "How far off axis can you go before the picture changes and degrades, and what's the point of dual cell?", "Is the One Connect cable in-wall rated? I noticed that it was not for the 2017 and 2019 models.", "Can this tv be connected /used as a monitor for a samsung flex laptop?!", "Can anyone with the tv confirm if it's hdmi 2.1 compatible? i've searched all over and it looks like it's just hdmi 2.0b.", "Is it possible to control this tv with apple homekit?", "Is apple airplay 2 built into this frame?", "Does the 2019 one connect cable fit the 2020 frame TV?", "Is this tv DirecTV ready?", "Can it be installed in portrait orientation? Can portraits be displayed or must it be in landscape orientation?", "Is the 32\" version really only 1080p? All the other versions are 4k, which is more appropriate for art even at the smaller size.", "Does the mount need to be adjusted if I add the bezel frame later?", "does this support HDMI 2.1?", "Does the TV come with a default frame/bezel, or does one need to be purchased?", "Can I use full motion wall mount on this TV? or it is only compatible with the mount it come with?", "Is the 18.2 inches high with the stand or without?", "Does it work?", "What is the si", "Does t his have extended warranty available?", "What does fire tv edition mean", "Does this tv have vudu?", "Can i connect my ipad to this? i want to navigate the ipad from the tv/monitor.", "Will this model also work with an antenna for over the air reception?", "Does it have internet? not does it connect via wifi, but does tv have a browser so you can use internet on tv?", "puedo tener la aplicacion de tv plus en esta tv?", "Can this tv be wall mounted?", "3-4 Months for delivery? Really?", "Does this run the Samsung TV+ app?", "Does this tv have a headphone jack?", "Does amazon music work with this tv?", "Does this tv have screen sharing or screen mirroring", "Can you download apps on this? Looking specifically at the Xfinity app.", "Where can i buy the wall mount adapter?? i need to mount it to my wall mount, but the manufacturer says it requires wall mount adapter first.", "Does this have a wake setting to turn the tv on at a certain time?", "Is this tv able to download the Peacock TV app?", "Is the disney plus app on this tv? if not, can it be loaded onto it?", "Do yu have 75 in", "Is the t.v Bluetooth", "Does this samsung have the pbs app loaded?", "what tv ship to Hawaii???", "Does this have wireless WiFi connection?", "How wide is this set?", "Is the tv roku compatable", "Does the tv work with miracast?", "Does it have tv plus channels on it?", "What are the measurements of the tv mounts ?", "Sling compatible", "Was it difficult to attach the leg stands?", "Does this TV automatically switch to last powered on source?", "Can this be hung on the wall and are the legs removable?", "Does this device support screen mirroring?", "Is it 220 volts too?", "What is the size", "wall mount vesa 200x200", "Buscar tv Samsung de 32 pulgada", "Does it have headphone jack if not how could i use headphones?", "do these tvs have remote controls?", "Does this support the roku app?", "does this tv support youtubetv app", "Is the weight only 9.5 pounds? I have a TV mount that has a limit of 60 pounds, so wanted to double check. 9.5 sounds very light.", "Does this tv come with the hbo max app?", "Can it be viewed from a 45 degree angle?", "does this have a manufactuer's warranty from Samsung?", "Do screws come with the stand? If so, none came with mine & I would like to know what size so I can get some.", "Does this have the Sling TV app", "Does this tv have sleep timer?", "Does this tv has hdmi ports?", "Can you connect a keyboard and mouse to this TV?", "Is the channel number indicated on the screen in large enough font that you can see it from across the room?", "Why is this TV difficult to set up?", "Does this model have the Disney Plus app ?", "Does it work as a monitor?", "Does anyone know why i still can't get sound from a new wireless digital head set on this samsung after trying \"source\" and \r\n \"settings?\"", "Is this 4:4:4, 4:2:2 or 4:2:0?", "Does the remote have numbers? I know that's a dumb question but I hate using channel up or down t go through 30+ channels", "does this tv have a built in tuner to record overair broadcasts?", "Can this tv be used as a basic tv through my local cable company? don't need anything fancy. also what tv stand must i buy?", "Can i connect my apple tv and dvd player to this unit?", "how are apart are the feet? I have to make sure it will fit on the console as we cant mount on the wall.", "is it wifi capable", "Can you mount this particular tv? Bought for a child’s room and didn’t see the holes for a mount.", "Can it be used with my other speakers?", "Is it compatible with comcast?", "How do I get more volume from the built in speakers? When the speaker volume is set at 100 (top volume), the best it does is conversation level) ??", "Does one of the hdmi ports list arc for audio conversion support to home theatre system?", "Can it tilt slightly up and down? Thanks", "Does this require a signature at time of delivery (usps)?", "Is this tv Bluetooth?", "IS this TV use ps4 for play games?", "Is this anew TV?", "Does this come with amazon prime video already installed or do i need a fire stick?", "Can you connect a bluetooth speaker to this television?", "Can this unit be mounted on a stand?", "What warranty is provided?", "What is the clearance between desktop and television?", "How wide is this tv? My space is small.", "can i use it as a computer monitor?", "Does this tv have hulu?", "Is Fubo TV supported?", "Is the smart Roku or Amazon fire, or Google?", "Does this tv stream SiriusXM ?", "How Many Hdmi port does it have", "Does this tv have samsung smart hub ?", "Does it have stereo RCA outputs?", "Has anyone tried using it with the Spectrum TV app, if so does it work well?", "Is this smart tv compatible with tivo? i have a tivo roamio plus box. thank you", "aux or optical port does it have either", "We are looking at this tv to purchase for my son’s dorm room on campus. is this a qam capable television that can accept hd signaling?", "is this DirectTV compatible?", "Does it have built-in tuner for antennas", "Does this tv have mirror capabilities ?", "Samsung website says the resolution on this set is 1366 x 768. Amazon description says 720p. Can someone explain?", "Can you hook up a sound bar?", "Is this a 4k tv . Does it have bluetooth .And finally the voltage.", "How tall is this tv with the stand ?", "how do I type a capital letter using my samsung remote when there is no button for that anywhere.", "Can you mirror or cast from android if tv has no wifi like Sony bravia", "does it need a special cable?", "what wall mount did you guys use and where do or can you screw the mount to the tv? i dont see any extra holes.", "Can this TV be wall mounted ?", "Is this compatible with Hulu live tv?", "Que tamaño tiene", "Does it have screen mirroring?", "Does it have a smart tv hub with Amazon Prime as an option?", "can this tv be hooked up a computer monitor?", "how is this shipped?", "Does this tv come with youtube tv app ? if not can it be loaded ?", "Can it see a 4tb usb drive?", "Does this tv come with any preloaded apps?", "Can you chromecast from samsung android tablet on it?", "Does it have charter/spectrum app?", "will this tv support a HDTV antenna hook up?", "does it have bluetooth", "Does it have Bluetooth for wireless headphones?", "can you wall mount this tv?", "What is the stand feet separation, I need to place this on a 20X16 stand?", "Can I connect my dvd and vhs tape players to this?", "Does it connect to cable? Does it have wifi so I can use computer?", "how tall is tvwith stand", "Can I sync my samsung smartphone to this tv?", "Is it a 4k tv", "Has anyone experienced problems connecting the tv to WiFi?", "Does this tv have the ability to get Disney Plus?", "Is this tv suitable for an unheated closed in porch? Temperature can reach 20 degrees", "Can i use this with my apple tv? any way to sync the remotes so i can only use one?", "can it be used a computer monitor?", "How many hdmi ports", "Does this come with netflix app? can you watch netflix through wi-fi or do you need to purchase internet?", "Can I use this tv with just an antenna ?", "what streaming apps are included on this smart tv?", "Is it compatible with samsung tv sound connect?", "Does it have bluetooth capability for pairing to my headset?", "Does this tv have surge protector ?", "Does software include youtubetv? not just plain youtube, but also youtubetv", "Does this have an hdmi port?", "What is the sound quality?", "this description shows two sizes. i need exact outside dimensions. which is correct?", "Does it do screen mirroring? One person says no, another says yes. I am going for two out of three.", "Pueden ser cajas de tv Samsung no en cajas grande", "What is the total horizontal width of the tv", "i don't see holes for a wall mount?", "I want to buy this for my nintendo switch. does it have a hdmi input connection? (i didn't see one in the picture or discription)", "Does the soundbar run on batteries?", "Does this tv have screen mirroring capabilities", "How far apart are the stands? Will it fit on a 24 inch surface?", "Is this tv mountable", "Does it have rocu", "does it have netflix , hulu and amazon prime on it?", "what sound system enhancements are recommended, as in opera a fine music?", "can this use 220volts ?", "roku compatible?", "Is the trim really black?", "Does anyone know if the smart software has become sluggish over time? I am looking to purchase one of these and don't want slow software. thanks", "Does this tv have night mode?", "Are the speakers on the side or bottom?", "how wide are the tv supports?", "Will this TV work with mirroring with smart things from my samsung phone?", "Can I use mirror feature on this tv?", "Does this tv have the DirectNow app?", "Does it have built-in DVD player", "dose this TV have Bluetooth?", "Can I use this as a desktop monitor?", "Does it have 802.11ac wifi?", "does this have a digital (optical) output?", "please recommend an antenna for this tv?", "Does this tv come with a built in HD tuner to pick up over the air signals?", "Can you connect a PlayStation to it", "How is the sound quality?", "Can the TV be scheduled to turn on/off at set times?", "Does this unit have the CBS app or can it be downloaded?", "does this have cable hookup?", "Can you watch contents In your phone on the TV?", "is this compatible with HBO Go?", "Can you get on youtube", "Does this t.v. have Netflix Hulu youtube", "I have to send this item to Portugal, Can it be use there with the electricity?", "Does it have netflix", "Will this offer the internet app like my Samsung 55 smart TVs?", "Is this compatible with Hulu live?", "Is the power cord, hardwired or plugs in to the TV?", "does it have component video and audio inputs for connection with vcr/dvd player?", "Can I connect a 1 tb harddrive to it to play videos", "Has anyone determined yet whether this tv has the directvnow app and the sling tv app?", "Can you hook up gaming system to this tv, such as the xbox", "What’s the shipping weight?", "Why not show remotes?", "What is the height of this television with the stand?", "What wires and connectors do i need", "I don't have cable or satellite.....can i watch nfl football?", "Does it come with app to watch Amazon prime movies?", "Is wifi required to watch over the air channels", "Will this TV work with Alexia?", "Can I watch Sling tv with this?", "how clear is sound can u hear vices over music", "Doe this support Xfinity beta app", "How do you wall mount this tv?", "My RV does not have hdmi, can I use the black cable with the standard screw end?", "Does this have bluetooth capability for a wireless soundbar?", "What is the max distance between the stand legs so I can see if it will fit on a table I want to use.", "Is this tv 3d?", "Can you watch regular tv on here without cable or internet", "does espn app install and work on this tv", "Does this TV have anynet plus built in?", "Can the legs be removed?", "How far apart are the stands?", "Can this tv mount to a tv cart?", "Does it have Bluetooth", "I can not find my som’s power cord for his un32m5300a samsung smart tv. how can i purchase one? i’m having trouble finding the correct cord.", "Does it have and audio out Jack", "what type of batteries for the remote control", "does this product come with a remote?", "Does this TV have a web browser?", "Can this tv be hooked to direct tv? Is it adaptable for tv wireless headphones? TY.", "Hulu keeps crashing and restarting tv new out of the box. I bought 2 of these and both do the same thing. Anyone else? Know a fix?", "Does this model have the ability to watch amazon videos from the amazon app?", "Will this tv work in portugal? Plug?", "Can you do next day shipping", "What to do if it is damaged during transportation", "With the factory stand, can this tv sit on a cabinet that is 30\" wide?", "How is the sound quality? is a sound bar needed?", "please recommend a wall mount for this tv?", "what is difference between 720 and 1080 p?", "what kind of adapter is needed for a wireless keyboard to work with this TV since it is not bluetooth. what adapter and what keyboard will work ?", "will it pause live tv?", "When the screen brightness goes can it be restored or do I need to buy a new tv?", "Is it smart things compatible?", "Does it have screen mirror", "Does this TV have a microphone and camera on it?", "hello. i would like to know the capacity of this tv?", "how is this packaged", "Can you add Sling TV directly onto this?", "what is the screen width\"", "Dose have smart view ?", "Will this or any other TV connect to a Bose radio via blutooth or must a cabel be used?", "My netflix won’t load. it used to work fine. how can i resolve this?", "If this tv only has one leg why does pic show two legs and is it 720 or 1080? Advertised as 720???", "Can you watch amazon prime on the tv?", "Can you download movies", "can you play a dvd player off of this TV?", "Is EMI available", "hook up dvd player?", "Does it have an input to run it through my sound system with amp?", "can does tv work on 230volts? and does it have a remote and will it work in india", "does it have youtube?", "Does it support bluetooth", "Does this TV have a wake up feature so I can set it to turn on at a certain time?", "Hi, i have never had a smart tv. do you also have an option to hook it to cable in case my wifi is bad?", "how can the product dimensions be 29.3 x 5.9 x 18.4 inches if the screen size is 32\"?", "Need to buy 40inch Samsung smart", "Does this tv have a web browser or the internet can only be accessed through the apps?", "Does the television come with the Vudu app?", "can you use Roku on this tv?", "does it comes with legs or pedestal? I need pedestal. how do I select that when ordering on amozon", "Can I connect a wireless keyboard", "Does this have built in chromecast?", "Can you use the Noggin/nickelodeon app for kids on this tv?", "Can you connect your elcetronic devices to the tv wirelessly?", "Easy to turn on?", "Anyone have issues with voice syncing? I have reset multiple times but is is just not rigth.", "Is this tv has stand position?", "Does this tv (particularly the 32\" model) have either an analog audio out, or bluetooth connectivity?", "Is it easy to program to direct tv with direct tvs remote", "What wall mount are compatible with thus model?woukd the x design swivel mount work?", "Does this tv have a ethernet port", "are this specs given on the TV, specifically height with the stand or without?", "Does it have an auto start up and shut down feature?", "Does this tv have Bluetooth for audio speakers?", "I drive a semi truck will this tv work in their.", "Can i get Spotify on this tv?", "Does the Samsung 32” 720 have rocky built in", "Does this have timeshift?", "Does this have usb port?", "Can I get the sling app on this tv with out fire stick or Roku?", "can you change the region?", "What is the shipping package size", "Can you watch something on the tv off your phone without WiFi?", "Does this TV have a spectrum app", "Does this TV have ethernet connections?", "What are demintions of wall mount holes?", "What is the distance between the legs ?", "Can i use fire stick with alexa with samsung model un32m4500a tv?", "does this have a sleep timer?", "Can this tv be optimized with hdmi uhd color?", "what are the dimensions of the mount mount", "Is this tv dual voltage...110v & 220v?", "Is this tv a supported device for hulu live?", "Is it a 4k tv", "Can this be plug on 220v outlet", "Can i add bluetooth sound bar to this tv even though it is not bluetooth enabled??", "Can you operate this tv without a remote? are there buttons on the physical tv?", "Does the tv have an ethernet port? How many?", "How does the text look when used as a computer monitor? Is it easy to read?", "Can I get my hulu app amazon prime and acorn app on this tv?", "How many watts of power does it take?", "Can you tune to a station directly with the remote if the station hasn't been detected?", "Does it have the youtube tv app", "Does this have the disney+ app?", "Can u ship to Tobagoand also need Samsung iphone", "Do I need to be pludded into cable to use?", "will this tv work in a motorhome with direct tv satelite?", "does this tv model come with the You Tube TV streaming ap installed?", "Will this stream video from my western digital mycloud nas?", "Is this tv led?", "Could i plug in a computer mouse to the usb port to more easily navigate the ui? including youtube and other webpages?", "Can i connect my dvd player, does this tv get regular channels, or is a converter box needed", "can you get Disney+ app on this model?", "Does it have a coaxial plug in?", "Does this tv has \"auto power on\"?", "Is this tv digital ready", "Can I use a Bluetooth adapter on this tv?", "will the samsung 32inch smart tv fit on the cabinet that is 29 inchs side to side an 16 inches top to bottom", "Does it support bluetooth? bluetooth and wifi are very different. you tube is connected by wi fi, not bluetooth. bluetooth is like a wireless keyboard", "With this particular one you can connect to cable / wifi, but you don't need cable to get the providers channels as long as you have the cable servi", "Do i need a digital converter or antenna for the TV", "The stand seems wobbly. How can it be made more secure?", "is this a roku tv ?", "Does this have the latest Hulu app for live TV?", "is this is a 220", "Will this work without having cable? I have wifi and modem but no cable.", "Can you install you tube tv app? Not just regular YouTube.", "Can I use the Amazon fire stick with this tv?", "Can I connect to the ring wireless door bell system?", "How many inches between feet? I only have 18\" to work with", "Can u ship to Tobago also need a Samsung", "Cant find the holes to screw on the bracket", "do I have to buy an antenna for OTA channels?", "Lots of bad reviews is it as good as people say?", "Can you hook up wi game to this tv", "could this tv be place on the wall", "Can this Tv play videos files from a hard drive?", "Is this TV Alexa compatible?", "4k in 33 inch tv", "On the TV Wall mounting options, does cord concealment with provider supplied cover mean behind the wall?", "can i connect 5.1 channel 500 watt 3d bluray home theater?", "does this work with a mac computer?", "does anyone have a picture of the remote to this TV?", "what is the voltage? 110v or 220v", "Is this tv good for 220 voltage???", "Does it have a wake up timer for the clock", "can it be hardwired for internet", "Will this tv connect to tivio by wifi?", "would like better quality speakers, how do i hook them up", "Can i use it for a monitor for my computer", "Is this TV 120 or 60 hz?", "what is the width of the base?", "Does the screen tilt or swivel on the standard mount?", "Can you Skype with the tv", "Does this tv have the vudu app?", "Does this TV work with Sling app?", "Where i want to put this tv has my viewing angle be 20-30° below the screen, sitting about 6ft away. how much do colors fade in that situation?", "Im trying to get a gaming setup figured out. Can anyone tell me if this would be a good tv for gaming?", "what is the VESA pattern?", "can i play amazon prime on this tv", "Does this tv have a usb port?", "Can you get netflix on this tv? and is it compatible with apple tv?", "How many hdmi inputs are there?", "Can I upload apps to it?", "How do you get the hdr to work on pc. have graphics card with hdmi 2.0.", "I am confused about whether i need a fire stick for this tv? some comments say they use it, others say it is not needed. do i need it?", "Does anyone know if this would be compatible with a Roku?", "This is a smart tv, correct?", "does it have a sleep timer ?", "What is the height of the 40 inch tv with the stand?", "Does this tv support wireless keyboards", "Is the 40 inch tv really 4k HD?", "Does this tv have bluetooth? samsung electronics un40mu6300 40-inch 4k ultra hd smart led tv (2017 model)", "Does this tv have Bluetooth compatability. Or would I have to by an attachment?", "This tv has a 'voice' that counts when i turn volume up or down. annoying. how do i get rid of it?", "can this tv mirror my pc screen?", "how would this work as a PC monitor?", "does it have wireless wifi", "Why does it ship 1 to 2 months>?", "i have dish network. do i need to purchase another box from dish? or will the tv have an option to sign into dish?", "matte or glossy screen?", "does this model has bluetooth capability?", "can this tv be walled mounted?", "Is it CableCard compatible?", "Can it be used as a monitor for a video tape player?", "I can’t seem to access hulu. the app is there but when i click on it it does nothing. any tips?", "does it have head phone jack", "Does anyone know how to pair the remote with a soundbar?", "Does this model hav bluetooth, can the tv speakers be on with a bose headset also be on audio?", "What is the dimension of the frame around the screen? 1\" or less?", "Does this tv work with wireless mouse?", "Does It Plug In?", "Will this tv model work in indonesia where power is 220v with just a simple plug adaptor or will it fry the tv ??", "Does this tv have youtubeTV", "I want to buy this unit and connect it to my exsitng comcast cable box will I need any new cables?", "Does the TV have auto On", "What is the differences in the series, mu8000, mu8000 premium or mu900 premium", "What are the dimensions?", "My cable box is not hd and it has a coax output along with rca jacks. how will the picture quality be?", "Does this tv operate at 110v and 220v ?", "how wide is the stand?", "Does this TV have 120 Hertz?", "This doesn't come with hdr does it", "How can i make the speakers within the tv louder? (without a sound bar) i have to turn the volume way up and its still not enough.", "My dad wants bluetooth headphones for his new samsung tv. anyone know if bluetooth headphones are compatible?", "Is the 4k resolution built in to the tv or do I have to set something to get that resolution?", "Does the 4k tv work with regular dvds or does it only play 4k dvds?", "What year is this tv and model number? i am trying to see if i can get pure flix on this tv.", "Does the t v work if the source is a reflector rather than a dish or direct tv connection?", "Does this TV have a Microsoft video app?", "what are the dimensions for a 40 inch 4k TV", "What is the width of the frame around the screen?", "Can a professional install my TV without wall mounting?", "what is the width of the stand of the tv?", "it's this a multi System tv ?", "How many inches is the monitor/TV without the stand? How far will wit sit from the wall if wall mounted?", "I just bought a samsung smart tv and learned from the service people at samsung that i can not get pandora music with the tv? has anyone else heard?", "Does this tv have a headphone jack or rca audio outputs?", "How many pixels exactly is it?", "What are the dimensions of the 43 inch when mounted on the stand?", "Can you get on the internet with this tv", "Does the 2017 6300 model have two USB ports.", "What is the thickness of the display panel on the ends? Looking at a tricky mounting issue. Thanks.", "Does this tv have the vudu app.", "Dose the TV have protective class over it like an iMac?", "Is the 120 Motion Rate better than 120 hz or is it the same thing?", "Is this tv good for gaming?", "How long is the base?", "Does the 23.5\" height include the stand on the 40\" model", "Does this tv have Bluetooth capabilities for speakers?", "Why the samsung electronics un40mu6300 40-inch class 4k uhd smart led tv is more expensive than the new model?", "Does this tv support file sharing over the networkm such as dlna or samsung link?", "Would this be good for the xbox one x?", "Keyboard for un40mu6300", "how wide", "Is there a headphone jack or can you only use Bluetooth headphones?", "what is the width of the stand?", "Is there a way to download a picture or artwork to have on the screen so it's not just a big dark screen when you're not watching the TV?", "does it have smart view for my Samsung phone", "What is height with stand", "on the un40mu6300 from the front, which side is the power cord on? and how long is it ?", "What are the dimentions?", "Canwe use only tv remote? We have satellite/cable remote that confounds my low tech hubby.", "What is 4k advantage?", "Does it have audio outputs, or can you only use a bluetooth sound bar?", "how do you turn off ambient it makes the TV color to dark for a visually imparted person.", "Does it have bluetooth? for example for speakers?", "besides pressing mute how do you make the talking lady shut up everytime you push a button on the remote?", "good for bedroom?", "Does this model have a headphone jack?", "how do i restart after power outage?", "What color is the tv", "does it adjust picture size to full screen automatically", "Whats \"UHD\"..?", "Dimensions diagonal", "What Blue ray player goes with this TV?", "Does this tv have screen mirroring?", "how many watt consume", "does this tv have bluetooth", "How many hdmi ports does this have?", "Does this tV come with a stand for setting on a cabinet", "Does it use 120 or 220 volts", "Is the electrical plug a low profile type that has room to be mounted into a plug behind the TV?", "What is the height without the stand?", "How well would this work as a PC monitor?", "Is this model bluetooth?", "Where are the ports on this TV (back, bottom, right or left side)", "Does the height given include the stand, or is that the display only?", "can I surf the internet on this tv?", "Which is better on PS4 pro this or the tcl 43s405", "Does this have HDR?", "Does the remote have point and click capabilities? If not, can such a remote be used on this tv?", "What ports r on the TV?", "Are there controls on the TV itself?", "how far does it stick out from the wall when mounted on the wall", "Does this tv have the google play store on it", "The base looks wide. can i set this tv on top of the bose solo 15 soundbar?", "Can I hook up an HD antenna, and use it outdoors?", "Does this unit have the Spectrum TV app?", "How would you rate the sound of this TV?", "can I use an amazon fire stick with this tv?", "Is it good for gaming?", "I would like to know how the speakers are? i see some saying they are horrible. i'll be using this in a small office 9x11 approx. sound bar needed?", "Are all sizes 4k or just the 75 inch?", "Apple iPad compatible?", "Does this samsung electronics un40mu6300 40-inch 4k ultra hd smart led tv (2017 model) support hulu live tv?", "Does this hav HDR", "Does this tv have ablue toothwith the wi fi", "Does this support hdr 10 for the xbox one s?", "Does this tv have an hdmi 2 port to use as a monitor or is it just the pc video card that needs the hdmi 2?", "what is the stand measurment tip to tip.", "Does this model have an \"over the air\" tuner or is it wifi only?", "Is Flash Support Available?", "What is the amazon box packaging size for the 40-inch? Thanks", "Is this tv hdr?", "Can this tv be corner mounted?", "Does this tv zoom mode", "Can you connect the remote to a cable box?", "Does the tv have an ips panel?", "what accessories are required for installation?", "Does this tv have the spectrum tv app?", "does this tv have the half mute feature", "Doen tv 40 inch has auto on fuction selectable media from usb? i'd like to use for automatic demostration .jpg file in the morning, does this have auto on time and select from usb?", "Will this tv turn on automatically when i turn on my tp-link plug like my samsung 28 inch 720p led smart hdtv un28h4500afxza does?", "Does this Samsung MU6300 have sub-titles?", "Does the hdmi support hdcp 2.2 ? any of them hdmi arc ?", "Does this tv have a 200 x 200 vesa mount pattern?", "How do regular dvd movies look? i really don't want to give up and rebuy all of them in bluray or 4k versions.", "Does anyone know the reponse time of this TV or how much is the input lag?", "does it have bluetooth", "Does it suport WiDi?", "do 4k videos work through wifi?", "what does \"smart\" mean?", "clear or satin screen ?", "this tv has wifi include?", "UN40MU6300, does this tv have bluetooth? does it have an actual power button or volume controls on the tv?", "How do i use my xbox 360 with this tv?", "Is it easy to add a sound bar? What is the best one to get?", "Can i get nba and mlb apps on this tv", "How many hdmi ports dies this tv have?", "what is the Ms response time i plan to mainly use this for gaming with the new xbox and i want to know im not going to have screen or input lag?", "will this work with ROKU?", "Does it have Headphone jack?", "what is the power supply a transformer on the power cord or just a 120 volt cord?", "Where is the turn on and off bottom of the tv?", "Is this tv chroma 4:4:4?", "How much time does it take for the TV to be ready to view after switching on?", "Can this be used as an additional PC monitor wirelessly?", "Does it have ethernet connection port", "What is 4K?", "What other parts do I need to hook this up?", "Does this model have Voice Guide?", "Does it have a built in DVD player?", "What is the fps? can you uses a vesa mount? will this be great with xbox x?", "Can I play a sd card?", "is the remote considered a \"smart remote\"?", "anyone know the lag on this one?", "Can i use a bose radio via blutooth to use as a speaker for this t.v.?", "does the logo samsung in front side light up when the tv is on?", "Can i get cbs all access on this tv?", "What type of lcd panel is in this model? ips or va? specs don't say", "What is the width of the stand on the 40 inch model?", "This tv has 3 hdmi ports. does it also have standard coaxial cable port and one for 3-headed composite cable?", "How do I turn off retail mode", "11.3 depth or width, 36.1 length, 23.5 height. Seems too thickight", "Can you download the xfinity app to play live tv if it is not connected to cable?", "what is height with stand?", "Not many samsung tv's have bluetooth. can i pair a set of headphones so i can listen to music or netflix in private?", "Doess this TV have blue tooth capability for headsets and such?", "I want to put this in my bedroom. Does it support Bluetooth for wireless headphones? If not, what kind of output is provided for wired headphones?", "Is vudu one of the apps on this tv?", "Does this model have wi-fi?", "can you get pure flix on this tv?", "Can i watch youtube on it like on pc? does it has browser to open internet pages?", "Does this TV have a headphone jack?", "I have directv genie is this tv directv ready?", "what are the file formats for usb connected video", "Di you need a remote control or not to control the tv?", "Can't connect to my wifi network \"wireless network connection failed\". thought the key i'm entering is not valid, well it is!! help? i want to watch", "Can i use my mlb.tv app on this tv?", "Can you actually browse the web? Or just some smart tv apps?", "Does anyone know what remote works with this?? I accidentally killed the last one", "What size screws do you need to put the mounting brackets onto the back of the tv. i know each tv is different, 4mm, 5mm 6mm etc. and what length?", "does this have a hook up for dvd player", "can you browse the internet?", "On the Samsung mu6300 and mu6290 where are the connections located, right side or in back?", "On the 40 inch version, where ate the network and video input ports? One the side, bottom or back? I want to know if I need extra clearance on back.", "What is the stand/Base width on the 40\" TV?", "Will the amazon dot or google home work with this tv?", "One of the reviews states to view netflix the viewer has to allow samsung to include ads. has anything changed since that was written january 2018?", "does this come with netflix", "can I use a wii with this tv", "What is the length of stand (from one end to another)?", "Will the remote interact with my other Samsung TV that have the same remote if they were put together in the same room?", "is there a manual for un40c8300sf", "Anyone’s else having internet connectivity issues with this tv?? This is the second time I have not been able to connect to the internet.", "Does this tv work well with a roku box?", "Does this tv have wifi built in?", "What if i don't want this remote taking over others, can i shut that off?", "Has anyone had an issue with their screen going black but still have sound?", "My directv does not recognize this tv as 4k? why?", "Is the WiFi ready or do I have to have a direct internet connection?", "does it have bluetooth to connect wireless headsets?", "How many hdmi ports does it have? are they all 60 hz?", "are the hdmi inputs hdcp 2.2", "Does this tv have a built in app store so i can download any app? for example the espn app.", "220 ~ 240 v Is it usable?", "Does it have a headphone jack?", "Can a standard remote control be used with this tv or any samsung mu 2017 series?", "Can the TV remote control sound through a non-samsung sound bar?", "Whats the refresh rate on this TV?", "Does this t.v have croma of 444", "Will this work the Xbox One X?", "Will this tv work with the xbox one x in 4k?", "Is this tv pal and not ntsc ?", "One of the reviews said they delivered and set up to make sure it worked .is it set up for you when you buy it", "Does it have to be a wall mount or can it stand alone", "What is the height of the 40 Inc have television with out the stand?", "A voice that narrates every click on the tv, from volume control to how long your show is got turned on. i can’t figure out how to turn it off?? help", "How tall is this tv with the stand", "Do mlb and nba apps work on this?", "Does this TV come with any buttons or are you relegated to the remote ?", "does it have bluetooth?", "Has anyone got this tv to pair and play sound through any echo device?", "If u don't have 4k contact can u lower the resolution to 1080p?", "Can I need a Ethernet cable? Or is wifi ready? ( without cables)?", "can you control this tv by talking to the remote?", "Is the stand removable?", "what is the input lag?", "Does this Tv have voice control?", "does it mirror", "Is it 2160p or 1080p?", "CanI hire someone to install my TV without wall mounting?", "Is this a multi system tv 110 - 220 volts", "Is it 1080, and does it have built in speakers?", "can I use my amazon fire stick", "can I change the language of the tv to Spanish?", "size of stand? wondering how wide is the maximum width of the stand? What is the depth of the stand from front to back?", "Will Apple TV work with this model?", "Can I use and antenna with this TV?", "how many kilo is shipping weight?", "What does it weigh ?", "What's the difference between un40mu6290 and un40mu6300?", "Can you set motion rate to 60hz ?", "what is the height of the 40\" model with the stand?", "Will this play mp4 formatted video files from a usb thumb drive?", "what difference with 6290?", "does it have captions", "ok, made the purchase 2 days ago will this be shipped soon?>", "Does this have a sleep timer?", "Does this tv work well with the ps4 pro? I've read that a few tv's have had issues working with the pro. Was wanting to know if this is one of them", "Set arrived with no threads in vesa holes. assume it’s a defect. is there a way to attach to a wall bracket?", "Is the picture quality any better on the Q70 series than on the Q60 series?", "Does this TV work with a computer?", "For 75\" model, how many speakers and Wattage per speaker?", "Refresh rate 120 hertz, motion rate 240 hertz...??? it cannot be both, so which one? a hertz is a hertz, period!", "Some parts here say refresh rate of 240, others say 120. Which is correct?", "Does this tv come with the hbo max app or can it be downloaded?", "Which bluetooth headphones and/or earbuds will work with this TV?", "Does this work without cable with an hd tv antenna?", "Can this be mounted on a stand? The distance between the legs is too long to fit on my table top.", "does this tv have vrr and lfc for gaming?", "Is anyone else having a problem with one of the stand feet not going into place?", "can Disney+ be streamed on this TV? Thank you", "It have a 2.1 hdmi port??", "are special wall mount adapters required?", "Does this tv have Samsung's no gap wall mount available?", "What size screws do you need to mount it?", "Contact the seller", "download apps", "What makes this one worth $350 more than the previous model, the qn65q60r?", "Is this good for a bright room?", "For the built in \"smart\" apps like Netflix, will they automatically stream in 4K?", "Does this have optical out for sound?", "Does this model have built in Apple TV?", "Does this tv have hdmi 2.1?", "Does this tv work with blue tooth headphones?", "I doubt this, but does anyone know if the tv speakers support true surround sound?", "any problems connecting with Spectrum cable box?", "Could you shipping to SouthKorea?", "Does it have eARC", "Samsung 55\" Q70 is there a center mount stand for this model", "What is refresh rate vs. Hz ?", "return policy on tvs?", "How many of the hdmi ports support hdr 10?", "Does this tv support Dolby Atmos?", "What are the product packaging dimensions? I need to fit it into a Hylander.", "This one came whit airplay for iOS and Android?", "Would this be a good pair with the PS5 and does it have a gamer mode ?", "I need to see the inputs on the back of this tv i have a room stereo system at the theater system and i have many jacks going into my old tv", "What is the distance between two legs of closer options for 85\"", "Can you get installation ?", "What are the input voltage and hz?", "Does this tv come with hdmi 2.1?", "What is the estimated yearly energy cost according to the energy guide?", "What is the exact width between two legs(including stands) of Q70T 65 inch. I have 45.5 inch table", "Does this have one connect box ?", "Does this 65” qled q70t series have hdmi 2.1?? i hear that that is does but only see reg hdmi port in pictures.", "Can you add apps as they are developed? my brand new lg won't let me add hbo max", "Can I have it delivered set up?", "what is the width of the legs from one another on the Samsung Q70 55 inch. My stand is 41 inches wide?", "Does it have pip (picture in picture)?", "For the 85\" qn85q70tafxza, 2020 model. what is the width of the stand? outside leg to outside leg?", "Does this tv use the Connect One system?", "How wide is the base of the tv?", "Is it equipped with Miracast?", "what is the voltage range?", "Is there a film / screen protector that I need to remove after unpacking on this model?", "How far apart are the legs", "Do i need a certain hdmi cable? or would any hdmi cable suffice?", "Does this tv have builtin wifi?", "I have a Bose sound-bar 700 with alexa built in will this be an issue if the tv has alexa built in too?", "Can this tv show what’s on my pc monitor through wifi?", "Can it play mp4 video files from usb drives?", "do you install?", "Can you use more than one set of Bluetooth headphones at the same time?", "Can the spectrum app be downloaded?", "does this tv have a built in vcr", "What is tv weight without box will it work for tv stand that supports 135 pounds", "It says it will work with Google assistant but how do you get it to work with it over bixby and Alexa?", "Which port is the hdmi 2.1 port? (port 3>earc or port 4 with the gaming icon)?", "Is this TV supposed to slant slightly? Mine is and just want to be sure it's supposed to.", "Does it work overseas? 220 volts", "can programs be recorded with this tv", "Does this tv not support hulu on its apps selection?", "Does this tv come with a 2.1 hdmi port", "Does this TV support dual voltage?", "what sound bar works best with this model?", "What is the actual panel refresh rate?", "I have Samsung now I want to mount on 4 hole bracket, does this tv have the holes?", "what is the difference between the qn65q6f flat 65\" qled & the 65nu8000 flat 65\" 4k uhd8 serries smart tx 2018?", "Your data shows a 120 motion rate while Samsung website shows 240. Which is it?", "Can this be mounted using a TV lift please?", "Is this sold as brand new?", "What is difference between led and qled?", "how wide are legs on 65\"", "In some of the customer pictures I see that there is ambient light emanating from the back of the tv. Is this a feature or some add-on accessory", "how do i find the warranty for the 855.75 open item from amazon warehouse ? does it still come with 1 year", "Is this the q6f series or uhd nu8000 or nu6950? confusing since uhd is in the model number", "I just bought this tv. I have a Bose 123 that requires av component connections is there any way to do this?", "I have a 48 inch tv stand. Will the 65 inch fit on it?", "Is this wall mountable?", "Are this TV a 2018 model or a 2017?", "What are the differences between the qled 4k uhd 6 series, uhd 8, and uhd 9 (besides price)?", "This is a big boxed tv (65 inch model). Has anyone received one that was damaged upon receipt and had to refuse it?", "Does the back panel peel off like in some other models?", "my tv stand is 59\" wide .. will this look OK or too big for the stand?", "What is the distance between the 2 legs for 65 inch", "Does anyone know why when i watch 4k content the screen brightens and darkness repeatedly", "Can external speakers, Bose system, be hooked up to this TV ?", "Is there a power button on this tv? will not respond to remote. was told tv needs a technician", "Tv return policy", "On the model qn65q6f: do i need to connect to the internet to watch tv using dishnet satalite?????", "Does it come with a stand?", "I buy this tv what dvd players i couldn’t buy? easy to install i am a 60 year woman", "What is the distance between the two tv stands on the 75 inch model?", "how is the viewing angle?", "Can you hook up wire less earbuds to this TV?", "What is the distance between the legs for the 65\" Q6F?", "Is the tv a backlit display?", "Is there an external power brick?", "Do this tv have HDR 10+?", "Does this TV come with a wall mount?", "Will this TV fit on a tv stand that is 44” from edge to edge max?", "Does this tv support Dolby atmos", "How many USB ports does the 65\" model come with?", "Can it be used in a 220v -240v Country?", "Is this tv autovolt?", "Compatible with Amazon alexa?", "What is the difference between a 120 mhz and 240 mhz refresh rate?", "Is this tv 5G compatible?", "Does this tv have a hdmi 2.0 or higher port, which is hdcp 2.2 compliant and has arc (audio return chaneel)?", "Does qled enhance shows that are broadcast in black and white (e.g. tcm)?", "can this tv be mounted over a gas fireplace?", "Is this tv dolby atmos compatible?", "Any reason to get the Nu8000 over the QN6 if same price? Is the 8000 series as good as the 6 series QLEds?", "Are it work in europe", "Recently got this set up, and it kinda goes in and out of looking great and not looking good at all. What do i do? Does directv need to stream higher?", "Does anyone know the dimensions of the box? I am not sure itnwill fit in my car. Thank you", "If the TV is not sold and shipped by Amazon, will the manufacturer's warranty still apply?", "what is the distance from the left stand to the right stand on 43\" model", "What is the dimension between legs of the samsung qn65q6f flat 65", "What is the distance front to back of the legs for the q6f? i have a stand that is 16\" deep and am hoping that is sufficient. thanks.", "Does this TV have an Ethernet port?", "is the 55\" q6fn or q6f ?", "Does this television support YouTube tv?", "Does this tv support Hulu live?", "How i play a movie from vlc on macos to the tv?", "is the picture quality in this as good as in the equivalent curved tv? or is it better or worst?", "What are the measurements for the 2018 qled connection box?", "How far apart are the legs on this tv ??? 65\" version", "Which tv model has 220 voltage? I want qled 65\" 4k samsung", "does this tv have analog outs for a soundbar?", "Do this TV work with Alexa?", "What types of mounts can you use?", "Can you get me the Samsung one connect box that could work with this TV", "What wall mount is recommended for the Q6fn 65”? The back is slightly curved.", "Can you turn this television on and off, and adjust inputs using a universal remote control, or do you have to use the tvs remote?", "Does the hdmi arc port send back 5.1 stereo to the receiver or just 2.0?", "What is the return policy?", "How Big Is It?", "Does this tv works with Alexa?", "Does anyone know the acceptable viewing angle?", "Height with stand?", "How is it for watching sports.....smooth motion?", "dose it work with 220v power supply?", "What is bixby? my wife wants a tv that works with her alexa echo. is this similar?", "does tv have bluetooth", "What are the Inputs/Outputs?", "I buy this tv what vcr I should buy??", "Cual es la resolucion", "How tall does the tv sit.. i have a 4'' tall sound bar would it fit in front of the tv?", "Does anyone have a 4k receiver that works with anynet+? What model? Im tired resetting the tv every day. doesn't work with pioneer vsx 934", "Is anyone having issues with streaming apps buffering through the tv apps? Weve used other devices (ps4) and dont have any buffering issues. Thank you", "Does the samsung logo light up like the KS8000?", "I see quite a few of reviews stating this unit gives them ads. Are these displayed in the smart TV functions?", "Will a sony mdr-rf985rkc headset work with this tv?", "what is the motion rate for the samsung qn65q6fn flat 65\" qled 4k uhd 6 series smart tv 2018 - 120 0r 240 motion rate", "Which model is best to buy", "what is the outside dimension of the feet on the 65\", I have an existing stand I would like to place it on that is 50\" wide by 15\" deep.", "Do this tv comes with Samsung connect box ?", "Is this a lcd or led tv?", "How does 480p sd content look? i had to return a different 4k set because sd content and old movies were very fuzzy.", "What are you getting in box with this TV", "Is there packaging?", "will the 65 in fit on a 48 in tv stand?", "does it have blue tooth", "Is it true that with this tv if you have a sound bar, when turning on tv you have to manually turn on sound bar every time?", "can i connect this TV to 240V?", "is this tv all Array", "What cables are included packaging of the samsung qled tv?", "What is the distance between the support legs on the 65”?", "Does it come with a sound board?", "Is this tv hdmi 2.0/hdcp 2.2? thanks", "Why does the display type day LCD?", "is the MR 240 or 120", "what size soundbar fits under qn65q6fn not wall mounted, on stand?", "Cual es el problema que tiene el tv?", "Is the power supply free voltage? Or is it 110v or 220v?", "Does this support HDR 10?", "Would someone please suggest a a tilt wall mount that is available in amazon? I am confused to which wall mount to buy for my Samsung 65\".Thank you!", "This TV has a curved back, what wall mount does it require?", "Can you use a roku box without it fighting with the smart TV stuff?", "What is this Screens input latency concerning Xbox 1 and video game performance compared to the 65in 2018 nu8000?", "Does this set have built in speakers?", "Just discovered that you can access the last or previous channel by pushing the microphone button and saying “last channel”", "What will allow me to turn tv closed captions on and off?", "Is this tv brand new and so samsung cover manufacture warranty?", "What is the USB rating for the Q6F?", "Does this tv have a digital optical output jack?", "What are the dimensions of the 65\" class - led - q6f series - 2160p", "Is it for gaming, and if it is should I put it in a dark room or bright room?", "I buy this tv what dvd I should buy?", "How do you fix it?", "is it true on curved tvs you cant appreciate the picture from left or right angle as well as on flat panels like this?", "It’s a original tv from samsung ???", "The 55 inch measures 30.7 inches in height, does this include the stand or just the TV?", "Can you watch game of thrones s8 episode 3 and actually see who dies?", "How sturdy is the stand? Can it somehow be secured to the flat surface it sits on?", "How many hdmi ports?", "can I put on its back to transport?", "Can this tv pass Atmos to soundbar by arc", "I only have over the air hd tv and netflix over dsl. will i still be amazed with the picture?", "Does it have the same connection box as the 8000 series? my 8000 hdmi arc constantly resets to tv speakers so does not work with my yamaha receiver.", "Is this compatible with google assistant/google home?", "What's the deal with the complaints about advertisements? Do the tvs nowadays have advertising capability?", "Anyone use a generic tv stand for the 65\" utilizing holes used for wall mounting and if so are you happy with it? My cabinet is only 42 inches wide.", "does the ethernet port supports all 10/100/1000 ? Cause i run speed test, download ETHERNET 30Mbps, getting WIFI 324Mbps what going on here?", "Is this 2160p?", "Is this TV tough to wall mount? Are the bolts in the box long enough?", "Does this samsung tv have an anti reflective screen? there was another tv i saw that was a bit more expensive, but offered that feature.", "What are the differances between the 6,7,8 series Samsung Qled tv's?", "What's the real difference between the qled 6 series and the nu8000 premium uhd?", "what is the warranty?", "Does this model series support Dolby atmos?", "What is a E manuel?", "Does anyone have dimensions on the stand?", "What Mouse will will work on this TV?", "Is the stand for the 5580t sturdy and is there much wobble in the panel?", "Why only 1 Star ??? Why not leave some kind of review , tell us why , ok ?", "What's the difference between 60, 70 , and 80 series??", "Will Alexa work when TV is off?", "How do amazon ships this tv? in the original box or in an amazon's box?", "Is wall mount included with this model?", "can i connect my stereo via Bluetooth", "Can a universal remote be used with the Q80T? Which one?", "Does it have a RJ-45 slot?", "What is the difference between the 80 r and 80t", "Is the Motion interpolation (soap opera effect) pretty strong in the 49 inch tv? I like that effect a lot.", "Does anyone know if this tv has or will support freesync premium in tbe future ?..thanks", "Is there that much difference between this 2020 version and the 2019 version? Is it a major upgrade?", "Qn55q80tafxza unit 30 lb cited weight with or without stand?", "Does this model come with the one connect box, and if not is it compatible with it?", "How long is the warranty?", "Is the remote control ir or rf? thanks.", "Does this have Anti-Glare?", "How much it weighs ?", "How many watts are the speakers?", "It says the tv has alexa, as well as the soundbar. why would anyone need two of them?", "Does this tv have all the hdmi 2.1 features out the box or does it need some sort of update?thanks", "Will Hulu live work with this tv?", "the tv comes with hdmi 2.1 cable included", "Can Alexa be turned off?", "Will this tv power up directly to the last chosen input, or does it first boot up into its own os, then i have to tell it to go to input?", "Does the Amazon Prime Video built in app play 4k video or will i need a 4k firestick?", "Can anyone recommend a wall mount for the 75\" q80t (2020) with good port access? manual says m8x26-28mm?", "What is the width of the base on the 65\" TV?", "Does it upscale from 720 to 4k? is it worth it to pay extra for the netflix 1080 plan? or even the 4k plan?", "Can it pass through dts:x via earc? this feature was not available on last years models.", "Do included apps like netflix and prime video pass dolby atmos to sound bars or receivers from the tv through the earc hdmi port?", "Does this tv have a protective screen cover/film that needs to be peeled off?", "Does this TV have a built in webcam?", "Does this TV have hdmi 2.1 ?", "Does this tv connect to my homes wireless signal or do I need a cable box?", "Have not set tv up yet. have roku, so do you continue to use that remote, tv remote, or both together?", "Does this tv have a full web browser?i already have a 55\" curved samsung 8500 that was working great until i moved.", "How many hdmi slots does it have?", "How come from 55\" to 65\" it is a 400 dollar difference but from 65\" to 75\" its a thousand dollar difference samsung just ripping us off?", "The other compared tv's are listed with wi-fi as a component while this model is not listed with wi-fi. does it mean that this model does not have it?", "Do i need special type of hdmi cable?", "How many remotes come with the 55inch 80t?", "What's the difference between the samsung q80t from amazon and the q8dt from other stores?", "Can you apply the Samsung picture frame option to this tv?", "Does this have hdmi 2.1 ports? does it support earc?", "Does it have Spotify built in?", "Does samsung q80 t 75 inches 2020 model is compatible with \"no gap wall mount\"? if yes, which one to get?", "Is it one connect box supported?", "How long are the bolts for wall mounting?", "Does the 65\" model base have any rotation? My current 50in TV base rotates about 20 deg and nice for watching from the kitchen when rotated.", "Has Airplay been fixed yet through an update?", "What wall mount can i use for the 49\" Q80T that won't block the inputs or power connection?", "Will it work with Tivo", "AMZ says 49\" model is 240 refresh rate in one part of the page, 60 in the other. I want 240, is it?", "Is the q80t really a downgrade from the q80r?", "Is tv has real 10 bit panel or 8 bit + frc panel?", "Does this tv have any streaming capabilities?", "Is there lag time in voices?", "Will it work with 220v electricity ?", "I cannot decide between the samsung 65 inch and 75 inch 4k tv. Is there a major difference in watching?", "do the newer models still have ambient mode?", "How far should I be sitting from a wall mounted 55\" TV?", "Does this 55\" TV swivel on the base?", "Will this tv work with Tivo", "dolby vision? ever?", "Is the ultra viewing angle same as the great 80r or really bad as some reviews indicate?", "What is the nits peak brightness rating?", "Is the refresh rate really 60 mhz? according to the manufacturer site it should be 120 mhz.", "Can anyone tell me the dimensions of the qn75q80tafxza (2020) stand? trying to see if it will fit w/o mounting.", "How far apart are the fee on a 49\"; my cabinet is only 32\"?", "Does this tv have 2.1 port", "Will someone who has galaxy buds+ please tell me if they work with q80t? my buds+ work with older tvs. non samsung buds work with q80t. note: xfini", "delivery and set up available?", "Are the \"like new\" samsung tvs still under manufacturer's warranty?", "What type of cable or adapter would i need in order to connect rca audio cables to this tv?", "Does this tv have a separated oneconnect box, for making the connections remotely? does anyone know the dimensions of that?", "Does it have 2.1 hdmi? Does it have arc?", "This shows the tv with a center-positioned stand, which i want, but the decription says \"wall mount\". what actually comes with it?", "Does this tv have a rca connection", "Does this 65\" sled q80 have artwork built in that can be displayed on the tv screen?", "What is the difference between q80 and q90?", "Does this tv have 2.1hdmi and 120 hz", "Does this model have Samsung’s glossy anti reflective screen or is it semi gloss?", "Do you need any extras from Amazon to take advantage of 'Alexa' ?", "Does it have Apple Airplay?", "Does this tv upscale 1080 content from cable box perfectly with no blurry picture?", "I have exactly 43.1\" of width space--will this t.v. fit? It has to fit inside a cabinet.", "I have an eight-year-old Samsung sound bar. Will it work with this model?", "Do i still need a smartthings hub to use Samsung smart light bulbs, or is the tv used as a smartthings hub?", "Does this tv have hdmi 2.1?", "Can this tv connect to 5ghz wifi or only 2.4?", "Does this tv has dolby atmos support?", "Does this come with hbo max", "Will amazon hang tv?", "Does this come with wall mount?", "Is the q90t your top of the line 4k tv and is it compatible with my q90r sound bar I bought last July?", "Samsun chat rep, said that this tv can use the no gap wall mount. he is wrong. but your photo for this tv shows it close to the wall. how?", "Is this tv a real 10bit color or just 8bit + FRC?", "how long is the power cord with this TV?", "Why can't i get the closed captioning feature turned on/off without having to di it through the xfinity cable box?", "Does it have 3D??", "How far from the tv, which is 55\" tv, should i be sitting for optimum view?", "Does this tv have Apple Air Play ?", "Does it also come with chromecast built-in?", "Can i pair with my echo studio to create a surround sound experience?", "Can i pair with my echo studio and play audio from both tv and studio to create a more immersive experience?", "Does it have a camera?", "Does the stand swivel?", "Does this have Fiber optic audio out put?", "eARC support?", "Does this tv support full 120hz via hdmi? will be using it with a pc is the reason i am asking.", "What version of hdmi is supported on this tv?", "Can you tell me how this tv works in a room with a lot of window glare and will I see the windows on the tv?", "Is it compatible with the new Sonos Arc sound bar ?", "Does it have subwoofer output?", "is it 220v?", "Can this tv produce 4k resolution at 120fps without motion smothing?", "How much does the 55 weight", "Can this tv be wall mounted?", "Would this tv be good for gaming?", "How much does the 85 inch weigh without the stand? I want to hang it on the wall and want to get the right wall mount that supports the weight", "To get the benefit of hdmi 2.1 can you use the 2.1 gaming port for tv viewing?", "Can this TV be mounted over an outdoor fireplace?", "What sized bolt are needed to vesa mount this?", "How far does the stand stick out from the screen?", "How many ethernet ports does it have?", "Does this tv have hdmi 2.1 ?", "Doe this tv come with the one connect box ?", "Is the bose 700 soundbar compatible with the q90r?", "is this model equipped with bluetooth audio out?", "Planning on wall mounting TV - tips/tricks, reviews make it sounds atypical and hard (debating paying for professional install)", "What is the difference between this and the samsung 6000 series. Is it worth the extra money?", "Will this work on any wall mount?", "What is the distance BETWEEN the two ends of the 65” stand? (from right leg to left leg). I need to find out if cabinet surface is wide enough", "Is there a way to turn off all the ads showing up in the TV's menus (Smarthub)?", "What color is the tv", "Can i plug in my hd antenna and recieve local channels? someone said there is no longer a tuner in the new 2017 tvs", "does this tv have bluetooth", "Does it play 3D?", "Can i watch netflix, amazon, hulu and youtube red built in?", "What is compatible with 42” Plasma tv", "What is the recommended receiver? i'm considering sony strdh770 and strdn1080.", "Is this a curved screen if so what's its flat counterpart model?", "Are the apps easy to use? Do they work properly? Is the t.v. easy to use?", "How do you project photos from my laptop on to the TV?", "What is the best hdmi cables to use to get the maximum tv connection and for my sound bar? thank you", "Built in speakers? What is quality?", "Can i plug a 4k source ( uhd bluray ) into the tv directly and then pass the audio signal along to my receiver using the arc hdmi port?", "Does this TV come with its own screws to secure to a standard 65\" supportable wall-mount?", "Is this compatible with yamaha avrs (such as rx-v483)?", "Is this a 3d tv if which 3d glasses I should buy", "My wife has normal hearing. i don't. does this tv accept a sony wireless headset?", "Do the feet come off? I'm going to mount this on a TV stand (like a wall mount, but a stand)", "how much space between bottom of tv and cabinet it sets on? Would like to set DVR on cabinet", "Does this have hdcp and or hdmi arc?", "Can you use Bluetooth speakers with this television? .", "Plan to connect this tv to the denon 6400h receiver. should i connect the internet cable directly to tv's one connect box or to the receiver?", "Will this tv pass through atmos through hdmi arc?", "Can i connect to directv?", "Can this tv be set up to use as a regular tv without an internet connection, assuming apps will not be used initially?", "How would i hide that box? this tv would be replacing a tv that is already on the wall, with all the cords hidden - i don't want to pay to redo it", "Is it worth extra $100 to get curved? What are benefits of curved?", "can legs be removed?", "height of stand from bottom of tv", "Can the leg mounts be removed? We would like to do a wall mount.", "What is the distance in inches between the two stand legs?", "Can this tv be mounted above a flagstone fireplace?", "How does this tv work with an atenna ?", "where do you hook up up all the hdmi cables?", "How do i delete tv channels? i want to just cycle through channels i keep.", "What size is the box it is shipped in?", "I don't have an optical cable running through my wall. only 2 hdmi cables & cat6. is there a way to connect the audio through my receiver with these?", "Has anyone had any issues with the 65\" model having a bad lean when using the stand?", "What samsung tv is comparable to the sony xbr65x850e 65-inch 4k ultra hd smart led tv (2017 model)", "What is the quality of the sound with only the TV's internal speakers?", "Is screen reflective? have room with windows and the lg oled was terrible, so had to return it.", "Can you mirror an ipad, macbook, and pc onto this tv?", "Can this tv be set up to control the volume of an new av receiver? or would you need to have the receiver remote at all times to control the volume?", "Does this tv support hdmi 2.1?", "can this product work in a country where the power supply is 220 to 240 ?", "Dose this work in jordan 220 watts", "electricity compatibility 220v?", "Has anyone here had trouble connecting their receiver to the one connect device.", "How is the grain on this tv? is it highy noticable? for example marvel series/walking dead.", "Does this TV pair with Samsung sound bars?", "I bought this TV and cannot figure out how to connect it directly to the internet from my router? There is no ethernet port.", "Would i be able to connect bose soundtouch 130 home theater system which has small control console with 4 hdmi inputs to the one connect mini?", "Do i still need to use my fire stick to use prime?", "Can you disable smart tv features?", "Does the One Connect Box have a head phone jack?", "Is this tv 3D?", "is the display bright enough for a bright room?", "Does this tv have voice control", "Does it have a gloss or matt screen", "What size mounting screws are needed?", "Is there no amazon protection plan to buy with this TV?", "what do you plug the hdmi cables into?", "Any suggestions on a good wireless keyboard for this TV?", "What is tge ditsnce between the legs?", "What is the spread of the feet? I want to make sure the feet will fit on my table top", "Should i put it on game mode or HDR for gaming?", "can you give me please the weight of the television in the shipping package", "How is the motions blur? we want to watch football withoir noticeable blur. Heard 120 in 65inch was horrible.", "What size room should you put a 65 inch television in", "Will the one remote also take the place of my Directv remote", "Differences between 8000 and 800D", "Optical audio out available?", "Does this tv have 3D", "Which DVD player is compatable with this tv?", "Can my kids play their ps4 (base, not pro) and basic xbox one (not x or s) on this tv? what about a switch?", "What's the deal with the no-opt-out ads i see mentioned in the reviews? if i buy this tv is it going to display its own ads??", "We have att/direct tv satellite dish;in order see the few 4k shows(we don't stream, really),we will have to upgrade our cable box to see 4k???", "Will the mu800 work with a soundbar and bluetooth wireless headphones? i am hearing impaired and wife is not. need sound from both.", "How long is the one connect cable? i plan on mounting this tv and wiring the tv to the one connect through the wall.", "what is the distance between the stand legs on the 75\"?", "Does it have bluetooth", "What operating system? Android?", "Does it works 220v", "Does this support 220 volts as well?", "Are the hdmi inputs hdmi 2.0?", "can this TV connect to dvd player", "I have my wi-fi connected to my tv , how can i connect it to my home theatre ? the modem or the router does not have any connections to add sound", "Can a current owner publish a photograph of the remote control?", "Will i be able to connect nintendo wii or if i buy converter from component or rgb to hdmi, will it work with un65mu8000fxza?", "How many inches do the legs jut out from the front - beyond the screen?", "Will this tv control a surround sound", "I have an older bose sound system that only has component (rgb) connection, can it be connected to the one connect box?", "Does this tv have an audio optical input", "Is this 3480 by 2160", "Does delivery include putting it in the room of my choice?", "Does it display banner ads that can't be taken off?", "Does this model support Dolby Vision?", "Does this tv come with forced ads? If so Is there a way to disable them?", "What is the average weight of this item for shipping pueposes?", "In reference to the 65\" model, with the legs attached, what are the actual dimensions?", "Does this TV have an optical output port for my Bose soundbar?", "What is the warranty on the Samsung 65 inch tv?", "Does the hdmi hook up in the back", "If I use bluetooth wireless headphones can others still hear the TV?", "Does this tv support arc? audio return channel..", "Is the 65 inch VESA Wall Mount compatable", "how big is the screen ?", "what size screws?", "If i use my 4k roku ultra for my internet content i assume i will be spared the forced advertisements. is this true?", "Does this connect to Amazon Echo?", "is this tv multi voltage or 110 only?", "Will the one connect box fit behind the wall-mounted tv, if the tv is angled downward?", "Does anyone know the thickness of the the bezel on the left and right sides? Is it under 1/5 of an inch?", "un65mu8000f I need this models power cord. 9 feet or longer. Can anyone help me find it?", "Hiw many USB ports?", "How long is the one connect cable? Is it 15 feet long so that i can hang the tv and run the cable behind the wall to my media cabinet?", "Can I use blue tooth head phones with MU8000?", "Does this tv have quantum dot technology", "Can you connect aux cable for audio?", "my only complain is about the proposition 65 warning. what do you know about it?", "And does this TV come with the one connect option bar?", "Is this tv blue tooth compatable?", "Does this tv have mirroring capabilities? can you wirelessly mirror your ipad, macbook, and/or pc?", "Does this TV have Ethernet jack?", "where is the HDMI cable input", "Unboxing my TV and was wondering if there a protective film on the screen that needs to be removed? Can really tell and no mention of it", "Has anybody have there Tv turn off right after startup and have to turn on again?", "banding issues?", "How many hdmi ports?", "where is the Ethernet port on the one connect or does the unit even have an ethernet port?", "is it possible to turn off the video image and have the audio (from directv) continue playing?", "Is there a minimum internet download speed required to get the best quality?", "Exactly what size M8 screws do I need to wall mount? The depth of bottom 2 holes on tv is different than depth of top 2 holes.", "does it have built in sound", "What is the depth of the stand?", "2 important areas as a gamer, and movie lover. 1st- How is the response time while playing a video game as well as motion blur/ image ghosting?", "How tall is the TV without and with legs?", "What is the difference between samsung model un65mu8000fxza and model un65mu8000 ? what is the fxza about?", "Does this have Amazon (prime) application installed?", "Will it run a gaming computer with gtx1080 ti no problems?", "Does the arc port support 7.1.2 sound?", "Can you stream uhd content with vudu or only hdx?", "What’s with all the “forced sponsor” adds poor ratings? Is this really an issue? Do they pop up during movies or gaming?", "Does this tv have the Comcast xfinity app?", "this is a great tv, however I am so worried about its California proposition 65 warning. Is this a harmful tv?", "Does this have a glossy screen or matte finish. I have a lot of windows and the one i have now is like looking into a mirror with the tv on", "Does the tv come with warranty from Samsung themselves?", "Does this tv have the high dynamic range?", "Is the tv stand included?", "This is the 2017 model. What is the difference between this and the 2018?", "Where is the optical cable output located on the tv? My one connect does not have it.", "Weight", "Is the bezel & case black or gray? Hard to tell from the pictures. Looks part black and gray or is that chrome?", "is there anyway to connect head phones?", "Does anyone know how high the legs raise the tv? i need about 4 inches to put the zvox soundbar under the tv. thanks.", "is the Tv Multivoltage 110 to 220??", "Can someone recommend a wall mount for my samsung mu8000? thank you", "I have a Bose soundtouch 300 with a acoustimass 300, cant get it to work on my mu8000.. help!", "Will this fit on my 47\" media center?", "Is the \"forced ads\" still a problem? april, 2018 - the reviews/forum posts i'm finding online about the ads are the only thing stopping me from buying", "To mount to the wall, documentation says the screws should be M8 45mm 125mm pitch but they don't fit. What size screws do I need?", "I've noticed is that i have to increase/decrease the sound volume (level 10-60) all the time. is this a common issue? using netflix app on the tv fyi", "Does this tv had access to the spectrum tv app?", "How good is this tv at displaying hi speed sports events? anything out there better?", ": is the TV is fully functional without internet connection?", "does the mu 8000 come with tv stand in the package", "What is the measurement for the 65\" with legs? I want to put a soundbar under the TV need height and distance from inner part of the legs", "Does the all in one box have an hdmi arc input connection? please let me know fast...thank you", "does this tv have voice comand", "I have a 65\" tv (samsung model: un65mu8000). the top of my entertainment center is 4 ft 4 1/2 inches wide (or 53\" wide): will the legs fit on it?", "How wide is it from leg to leg in inches? this tv is bigger than the stand where i want to place it, by two inches, obviously the legs are not as wide", "Just ordered the 82', starting to wonder if i should have went 75' q7f..qled really worth 7' less and $200 more? opinions?", "Will this model ever update its app selection to include the Apple TV app?", "When u add the wall mounting service delivery do the pout a plug in for you at the wall so you habe no cords?", "Does this have voice remote", "Can the smart remote operate a direct tv digital video recorder(dvr)?", "Is there an Extended warranty offer", "What is the width in inches between the legs of the stand? my tv cabinet is 50 inches, need to determine if the 64 inch tv, stand legs will be lesss", "How wide is the stand? Will it fit on a 42 in TV stand?", "are there different kinds of HDMI cables?", "Does this tv have smart sound or sound stabilization? Meaning, does it adjust for sound discrepancy between programs and commercials?", "Thinking of getting this 65 tv. I have an older onyko receiver with Bose 5.1 surround sound cube speakers. Will this set up work with this tv?", "Is it possible to turn off the smart features? If so, will this disable the ads which I see several complaints about?", "Can you plug in a usb and record ota tv?", "Is the mu8000 a safe alternative to the qled?", "Any thoughts about which tv is better -- samsung un65mu8000 or lg 65sj8500? i can't decide! hoping seller wide world stereo will chime in on this. :)", "Can two or more Bluetooth headsets be used simultaneously?", "how are the speakers", "What is included with the tv", "Do the legs on this TV adjust further in do they stay out?", "How long is the oneconnect cable?", "Un55mu8000 or qn55q6f? what's your opinion?", "can you hook component to one connect box?", "Will this work with a bluetooth hearing aid? If so, can others in the room still listen to the tv, while the tv is connected to a hearing aid? Thanks!", "What is the 4k? Why it is so special?", "What is the thickness of this tv? i am planning to mount on a cavity in the wall and wanting to know if it would stick out or not. thanks", "Is the one connect box the only interface or does the tv have any on board hdmi ports", "We like the TV, but it randomly turns off and on. Any ideas why?", "have a tuner ?", "I need a replacement one connect cable. Anyone know how to find one?", "Does anyone knows how to use the button that has 4 differents colors and how to set them up?? Anyone?", "does this tv have built in blue tooth", "Does this tv work with Echo?", "Can you get Steam link on this via the app?", "Does it have inbuilt chromecast?", "Can this tv be controlled by Alexa?", "how do you get or view a 4k picture or channel? where can you find 4k programs, movies?", "Do nextflix and amazon prime stream ok on this tv?", "Would somebody tell me the box size and weight?", "The box says dual voltage but the back of the tv says 110....am I able to plug into 220?", "How wide (far apart from each other) are the legs on the 65” model? the legs are narrower than the tv and i need to know if it will fit on my tv stand", "What is the distance between the stand legs on the 65\". Thanks.", "How far apart are the legs on a 65\" un65mu8500? i have a 42\" base", "Does it have disney plus?", "Is this tv of good quality for use as a computer monitor?", "I lost the remote for this and need to replace it- a smart remote i believe. Would anyone have the link to replace the remote?", "Does this tv support sling tv?", "Will this tv support mirracast?", "what does the remote look like", "Can it be wall mounted?", "Does this support roku and amazon prime?", "doe it comes with digital tuner?", "does this TV support spectrum app?", "can you watch youtube?", "Does this have mirror cast listed in the on screen input menue?", "does this item have wwe app", "Are the hdmi ports rear facing or to the side?", "Does ps4 work on it?", "How is the sound? What watt are the speakers?", "Does this tv have WiFi?", "Are wires and power cords are waterproof?", "does this tv come with the Spectrum App loaded?", "Can I leave this TV outside during the winter?", "What ceiling mount do you recommend ?", "Is there a particular wall mount that is recommended? Will a Rocketfish mount work?", "What stand does recommend for outside?", "How much water and heat can resist?", "Can it be used with a stand instead of wall mounted?", "Does the tv come with the spectrum app?", "Does this 65\" 2020 q900ts have hdmi 2.1 inputs?", "Does this model have any glare? My last tv a samsung q7 does not and I wanted another tv that does not glare.", "Whats the difference with the q900ts 85\" and the q950ts 85\"?", "can this be wall mounted?", "Does this model come with the One Connect box?", "My uhdtv 8 series 75\" 2019 keeps turning off and on.", "Does the 2019 version include the newest features that were introduced on 2019 4K models? IE: anti reflective filter and wide viewing angles?", "how long is the \"invisible connect cable\" that comes with it?", "does this tv come with apps built in, Netflix, Utube,ect. ?", "Just received my 65inch version and I tried to download the 8k video from youtube and tried playing on this tv, but it says unsupported format ?Help ?", "Does do Dolby atmos", "Is this 75\" tv vesa compliant? i don't want to use the included no gap mount and would like to use a scissors type articulated tv mount.", "Does the 2019 Q900r 82\" 8k come with the no-gap wall mount?", "Will it work like an echo device?", "For the 65 inch model, with the provided TV stand legs, how high is the bottom of the screen above the table top?", "Does this tv have component and composite input on it?", "8k at 120 hz ps5 and xbox scarlett?", "Whats the distance between the legs on the 82 inch set, is the option available to make the legs closer together? Thank you", "I have a very small room and i sit about 4 feet from my tv will the 65 inch 8k will the full resolution be shown at that length?", "What is the max FPS ?", "Can remote speakers, headphones or other hook-ups thru the Q900 series bluetooth system?", "Does this tv have a tuner?", "Can this TV be connect to 5.1 sound system?", "Does it come with a no gap mount", "If i have 8k image files can i display on this tv?", "Does this have bluetooth ?", "Can it be used without Internet?", "It’s that the same in Europe forQ950?does it include hdmi 2.1 and new update?thanks", "Is ther a way to decrease the intensity of its optical output ?", "Does it do earc", "Is there an app for a smartphone to remote control the tv?", "Is anyone using this ( 8k, 55 inch) as a computer monitor with an 8k video card?", "No reflection TV ?", "Are 8K or 4K HDMI cables necessary?", "Does the tv produce sound or do I have to buy a separate speaker", "Can anyone tell me the power input for this TV box? is it 110v to 240v? Or only 110v?", "does this have hdmi 2.1?", "Where is it made?", "what channels even broadcast 4k, let alone 8k", "Are all the hdmi ports 8k or just one?", "Can you watch blue ray movies in this tvs?", "I just purchased the 75\" unit. however the youtube app does not go over 4k in resolution when the content is available in 8k?", "How well does it upscale regular content to 8k resolution?", "what are the available ports and how many of each?", "Is this a true 120htz or that cheap auto motion plus feature", "Bluetooth to earbuds ?", "will it work with a VESA bracket?", "how good is the quality of the tuner on board the tv?", "Sound specs", "Does this tv have hdmi 2.1 ports?", "Does this tv have hdmi 2.1 for 8k total support????", "Does it do hdmi 2.1", "Can i only use a no gap mount for this tv or can i use a swivel mount that can support the weight? does the tv come with a mount?", "i need professional installation", "will this 8k model upscale 1080i from cable broadcast better then 4k oled ?", "Is it possible to do the one connect cable for in-wall setup, or it's not rated for in-wall installation? If it's not, what are the options?", "does this tv have bluetooth that will allow me to watch videos from my phone on the tv ?", "will this tv support the ps5(hdmi 2 upgrade) or do i have to purchase the q900r version?", "what’s the right no gap wall kit to buy for the 82”?", "Can display 8k at 120hz?", "Does this model qn75q900rbfxza 75\", come with the no gap wall mount in the box?", "Does the 82 inch come with the no gap wall mount included in box? I see on Samsung’s website that it’s included with 82 inch and 98 inch", "is the 4k Q90r really better than this one? i'm going insane. research points 4k having deeper blacks and less reflections in bright environments", "How well does 1080p to 8k upscaling work?", "8k at 120hz?", "Does it come with a one connect box and if not where do i find one that works with it?", "Does it support 220v?", "Would this work with a vesa mount tv stand?", "I recently got a 4k tv does anyone think it’s worth getting an 8k tv right now or should i wait until the tech gets better and widely available?", "Does the 65 inch TV fit on a console that’s 52 inch wide?", "What is the distance between the legs for 75 inch q900?", "Does it do Dolby atmos", "Does the 2019 Q900r 75 “ 8k come with the no-gap wall mount?", "does this 75 inch come with wi-fi direct", "What is the ethernet speed?", "Wall mount is possible", "How would it work as a Windows monitor with a good video card? Are app icons large enough?", "Can it play 8k 60 FPS pc gaming with hdmi 2.1 ?", "Does it need Internet up scale to 8K?", "Does it do dolby vision dolby atmos earc hdmi 2.1", "How picture compared to 4k", "Which mounting brackets to buy with samsung qn75q900rbfxza flat 75-inch qled 8k q900 series ultra hd smart tv with hdr?", "Are you really trying to show me the difference between 1080p and 8k in a video that I can't help but watch on my 1080p monitor? Seriously? Too funny!", "Does the 2019 model have an atsc 3.0 tuner?", "I’m from the UK and will need to import. What plug does this t.v have?", "I want the tv to come in 200-240 volts, is that possible", "Do you have to use the no gap mount? I’d like to use an articulating mount.", "Do you think there will be 8k games on Xbox One X ?", "How many hdmi 2.1 cables do I need?", "What is the leg distance on the 65 inch model?", "What’s is the total height of the 65” and 75” models with the stand attached?", "Does this tv support hulu live, i understand it will support hulu like a lot of tv's will but does it support hulu live?", "HDMI 2.1", "8k 120hz", "What is the length of the invisible fiber optic cable that comes with the TV?", "Can the stand be raised so I can put a soundbar under it?", "Does this tv have apple airplay built in?", "Is there anyway that this unit can receive an audio and video signal from a thunderbolt 3 cable?", "Is it normal for the tv to get hot after being on for a while? Should I be worried and contact Samsung?", "How much clearance will there be under the tv if you have your tv on entertainment system?", "Does the fact that the Q900 has an \"auto protection time\" setting mean that it's susceptible to burn-in after 2 hours if a still image is displayed?", "I see that you are constantly fed with ads on this tv via samsung ? is this true ? how to turn this off ?", "Is 75\" comes with no-gap wall mount in the box?", "What is the distance between the legs on the 55 inch model? From the outside of one leg to the outside of the other leg.", "Does qn75q900rbf include the samsung no gap wall mount?", "I am vu 65 inch qledq 900 4k 8k i am trouble with the hdmi arc sometime does sound comes out out of my soundsystem i have to keep playing around with", "What are the 65 \" tv qled dimensions", "How far apart are the feet?", "Bluetooth to air buds ?", "Is this model qn75q900rbfxza compatable with 3d technology?", "Is it normal for TV to get too hot after being on a for a while?", "Why do I need 8k if nothing is in 8k?🤔.", "Is this tv hdmi 2.1 compliant?", "What is the refresh rate in hertz on the 75inch model?", "How many of the hdmi ports are 4k 120hz?", "Is tv ratio 21.9?", "Can someone try for this tv: turn on tv power, unplug the tv (don't turn off), does tv come back on when plug back in? or must you power on again?", "Does anyone know what kind of Warranty this comes with ?", "Works will all current standard [non 4K] blu-ray dvd players?", "Will it work with a tabletop tv stand?", "Can this tv be mounted using standard mounting pattern like vesa? i already have a scissors type mount for a 70 inch vizio.", "Why are they making 8k tvs with no 8k content and we are just now adopting 4k tvs for movies and games?", "Does this TV support 3-D", "Why is 75 8k 240 hz. 82in 120 hz?", "Any ps4 or xbox issue?", "What type of WiFi is the Q900 series? (80211.??)", "on the 75 inch 8k Q900 2019 model how far are the legs from the side of the tv ?", "Does this tv support eARC?", "Does Samsung tvs have special financing ?", "How many hertz is this display?", "Is a new receiver requires for 8K TV ?", "Does anyone have trouble with tv giving off excessive heat", "Does the one connect box box generate much heat?", "does this tv support hdmi 2.1?", "I want to know if the voltage. from the tv is 220v", "Does this tv have an hdmi (arc) in connection", "Does this 8k samsung support the full hdmi 2.1 specs? lile 48gbps (newer cables required), i mean the entire 2.1 spec, audio too? not half baked!", "Does this range have the at&t tv now (old directv now) app in it’s app lineup?", "Can anyone name me a single source where they can actually access an 8k signal for any entertainment to justify buying this?", "Does it support earc", "I'm an older fellow with poor eyes. How's text readability on this set if it were used as tv/monitor?", "Is it worth the price?", "Will a soundbar fit underneath the TV if On a table ?", "Can the One Box be mounted in an unvented cabinet? Heat?", "3D ready?", "I have a 4k tv and i can see the difference without 4k service on my tv. my question is with this 8k tv what do the same giving me enhance picture qua", "Does tv have a adjustable arm wall mount.", "What is the length of the \"one connect cable\" that comes with the samsung qn75q900rbfxza tv?", "Is there a special type of hdmi cable i need for this 8k television?", "Is this tv compatible with Disney plus app?", "How many hertz?", "can you stream the 8k Video from youtube, in other words does this tv support this format to be seen ?", "82” Samsung Tv exterior dimensions?", "On the 55 inch version of this tv how far are the legs from the side edge of the tv? only interested in knowing about that size tv.", "Soap opera effect?", "The Samsung website shows the length of the foot of each stand leg is 15.1 inches? That's really big. Can someone confirm this for the 55 inch model", "can it work with 220 volt ?", "Does this tv’s usb port play mp4 videos (on a usb drive) recorded at 100 mbps? are the usb ports 3.0?", "Does it have Bluetooth", "Can you mount and orient the content on this screen vertically?", "Where are the two connections on the back of a vizio m55C2 ?", "If i want to use this set as a huge computer monitor, rather than a tv, how well does that work? i'd be using it for programming, not gaming."]